NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
/**
 ****************************************************************************************
 *
 * @file tuya_ble_hal.c
 *
 * @brief HAL for TUYA
 *
 * Copyright (C) GigaDevice 2023-2023
 *
 ****************************************************************************************
 */

/**
 ****************************************************************************************
 * @addtogroup APP
 * @{
 ****************************************************************************************
 */

/*
 * INCLUDE FILES
 ****************************************************************************************
 */
#include "ble_export.h"
#include "ble_adapter.h"
#include "ble_adv.h"
#include "ble_scan.h"
#include "ble_conn.h"
#include "ble_l2cap_coc.h"
#include "ble_sec.h"
#include "ble_gatts.h"
#include "ble_gattc_co.h"
#include "ble_gattc.h"
#include "ble_storage.h"
#include "dbg_print.h"
#include "ble_utils.h"

#include "wrapper_os.h"

#include "ble_gap.h"
#include "dlist.h"
#include "tuya_ble_hal.h"
#include "ble_sec.h"
#include "gd32vw55x_platform.h"


/*
 * DEFINES
 ****************************************************************************************
 */
/// Definitions of the different ble task priorities
enum
{
    /// Priority of the BLE stack task
    TKL_BLE_STACK_TASK_PRIORITY = OS_TASK_PRIORITY(2),

    /// Priority of the BLE APP task
    TKL_BLE_APP_TASK_PRIORITY   = OS_TASK_PRIORITY(1),
};

/// Definitions of the different ble task stack size requirements
enum
{
    /// BLE task stack size
    TKL_BLE_STACK_TASK_STACK_SIZE = 768,

    /// BLE APP task stack size
    TKL_BLE_APP_TASK_STACK_SIZE   = 512,
};

typedef struct tkl_read_info {
    dlist_t     list;
    uint8_t     conn_idx;
    uint16_t    char_handle;
    uint16_t    token;
    uint16_t    max_len;
    uint16_t    offset;
} tkl_read_info_t;

enum tkl_ble_app_evt_id
{
    TKL_BLE_APP_EVT_RSV               = 0x00,
    TKL_BLE_APP_SCAN,
    TKL_BLE_APP_ADV,
    TKL_BLE_APP_CONN,
    TKL_BLE_APP_GATTS,
    TKL_BLE_APP_GATTC,
};

typedef struct ble_scan_info
{
    TKL_BLE_GAP_SCAN_PARAMS_T     params;
} ble_scan_info_t;

typedef struct {
    uint16_t    length;
    uint8_t     data[0];
} tkl_ble_adv_data_t;

typedef struct {
    tkl_ble_adv_data_t    *p_adv_data;
    tkl_ble_adv_data_t    *p_rsp_data;
} tkl_ble_adv_rsp_data_t;


typedef struct ble_adv_info
{
    union
    {
        TKL_BLE_GAP_ADV_PARAMS_T     params;
        tkl_ble_adv_rsp_data_t       adv_data;
    } data;
} ble_adv_info_t;

typedef struct ble_init_data
{
    TKL_BLE_GAP_ADDR_T            peer_addr;
    TKL_BLE_GAP_SCAN_PARAMS_T     scan_params;
    TKL_BLE_GAP_CONN_PARAMS_T     conn_params;
} ble_init_data_t;


typedef struct ble_conn_info
{
    USHORT_T    conn_handle;
    union
    {
        ble_init_data_t              conn_params;
        TKL_BLE_GAP_CONN_PARAMS_T    conn_upd_params;
        UCHAR_T                      disconn_reason;
        CHAR_T                       *p_name;
    } data;
} ble_conn_info_t;

typedef struct ble_gatts_add_srvs
{
    uint8_t                 uuid_len;
    uint8_t                 uuid128[16];
    uint16_t                start_handle;
    uint16_t                total_handles;
    uint16_t                cccd_num;
    ble_gatt_attr_desc_t    *p_srv_table;
} ble_gatts_add_srvs_t;

typedef struct ble_gatts_val_info
{
    uint16_t                conn_handle;
    uint16_t                char_handle;
    uint16_t                length;
    uint8_t                 *p_data;
} ble_gatts_val_info_t;


typedef struct ble_gatts_info
{
    union
    {
        ble_gatts_add_srvs_t       add_srvs;
        ble_gatts_val_info_t       val_info;
    } data;
} ble_gatts_info_t;


typedef struct ble_gattc_disc_info
{
    uint16_t                start_handle;
    uint16_t                end_handle;
} ble_gattc_disc_info_t;

typedef struct ble_gattc_write_info
{
    uint16_t                char_handle;
    uint16_t                val_len;
    uint8_t                 *p_value;
} ble_gattc_write_info_t;


typedef struct ble_gattc_info
{
    uint16_t conn_handle;
    union
    {
        ble_gattc_disc_info_t     disc_info;
        ble_gattc_write_info_t    write_info;
        uint16_t                  read_char_handle;
    } data;
} ble_gattc_info_t;

typedef struct tkl_adv_actv
{
    uint8_t idx                 /**< Advertising set index. */;
    uint8_t type;               /**< advertising type, @ref ble_gap_adv_type_t. */
    uint16_t prop;              /**< Advertising properties.
                                    @ref ble_gap_legacy_adv_prop_t for legacy advertising,
                                    @ref ble_gap_extended_adv_prop_t for extended advertising,
                                    @ref ble_gap_periodic_adv_prop_t for periodic advertising. */
    uint8_t pri_phy;            /**< Indicate on which PHY primary advertising has to be performed, @ref ble_gap_phy_t. */
    uint8_t sec_phy;            /**< Indicate on which PHY secondary advertising has to be performed, @ref ble_gap_phy_t. */
    bool wl_enable;             /**< True to use whitelist, otherwise do not use. */
    uint8_t own_addr_type;      /**< Own address type used in advertising, @ref ble_gap_local_addr_type_t. */
    uint8_t disc_mode;          /**< Discovery mode, @ref ble_gap_adv_discovery_mode_t. */
    ble_gap_addr_t peer_addr;   /**< Peer address, used for directed advertising. */
    ble_adv_state_t state;      /**< Advertising state. */

    tkl_ble_adv_data_t *p_adv;
    tkl_ble_adv_data_t *p_rsp;
} tkl_adv_actv_t;


typedef struct {
    dlist_t       list;
    uint8_t       srv_id;
    uint16_t      svc_handle;
    uint16_t      cccd_num;
    uint32_t      cccd_handle_tuple[0];       // char_handle | cccd_handle
} ble_cccd_info_t;

typedef struct
{
    dlist_t       list;
    uint8_t       role;
    uint8_t       conidx;
    uint16_t      conn_handle;
} tkl_conn_dev_node_t;


/// Adapter environment structure
struct tkl_adp_env_tag
{
    UCHAR_T                 role;
    dlist_t                 read_list;
    dlist_t                 srv_cccd_list;
    dlist_t                 conn_dev_list;
    uint16_t                srv_add_handle;
    tkl_adv_actv_t          adv_info;
};

