NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
typedef struct tkl_app_msg
{
    uint16_t      id;

    union
    {
        ble_scan_info_t       scan_info;
        ble_adv_info_t        adv_info;
        ble_conn_info_t       conn_info;
        ble_gatts_info_t      gatts_info;
        ble_gattc_info_t      gattc_info;
    } data;
} tkl_app_msg_t;

#define TKL_ADV_INVALID_IDX         (0xFF)
/** @brief BLE advertising type. */
#define TKL_BLE_ADV_TYPE_LEGACY     0       /**< Legacy advertising. */
#define TKL_BLE_ADV_TYPE_EXTENDED   1       /**< Extended advertising. */
#define TKL_BLE_ADV_TYPE_PERIODIC   2       /**< Periodic advertising. */


#define TKL_BLE_EVT_ID_TYPE_GET(id)         ((id & 0xFF00) >> 8)
#define TKL_BLE_EVT_ID_SUBTYPE_GET(id)      (id & 0xFF)

#define TKL_BLE_EVT_ID_SCAN(subtype)         ((TKL_BLE_APP_SCAN << 8)   | subtype)
#define SCAN_SUBTYPE_DISABLE       0
#define SCAN_SUBTYPE_ENABLE        1


#define TKL_BLE_EVT_ID_ADV(subtype)         ((TKL_BLE_APP_ADV << 8)   | subtype)
#define ADV_SUBTYPE_STOP          0
#define ADV_SUBTYPE_START         1
#define ADV_SUBTYPE_DATA_SET      2
#define ADV_SUBTYPE_DATA_UPD      3


#define TKL_BLE_EVT_ID_CONN(subtype)         ((TKL_BLE_APP_CONN << 8)   | subtype)
#define CONN_SUBTYPE_DISCON                   0
#define CONN_SUBTYPE_CONN                     1
#define CONN_SUBTYPE_CONN_PARAM_UPD           2
#define CONN_SUBTYPE_CONN_RSSI_GET            3
#define CONN_SUBTYPE_NAME_SET                 4

#define TKL_BLE_EVT_ID_GATTS(subtype)         ((TKL_BLE_APP_GATTS << 8)   | subtype)
#define GATTS_SUBTYPE_ADD_SRVS                0
#define GATTS_SUBTYPE_SET_VAL                 1
#define GATTS_SUBTYPE_VAL_NOTIFY              2
#define GATTS_SUBTYPE_VAL_IND                 3

#define TKL_BLE_EVT_ID_GATTC(subtype)         ((TKL_BLE_APP_GATTC << 8)   | subtype)
#define GATTC_SUBTYPE_DISC_SRV                0
#define GATTC_SUBTYPE_DISC_CHAR               1
#define GATTC_SUBTYPE_DISC_DESC               2
#define GATTC_SUBTYPE_WRITE_CMD               3
#define GATTC_SUBTYPE_WRITE_REQ               4
#define GATTC_SUBTYPE_READ_REQ                5


extern ble_status_t ble_gatts_ntf_ind_send_by_handle(uint8_t conn_idx, uint16_t handle, uint8_t *p_val,
                                              uint16_t len, ble_gatt_evt_type_t evt_type);

/*
 * ENUMERATIONS
 ****************************************************************************************
 */

/*
 * LOCAL VARIABLES DEFINITIONS
 ****************************************************************************************
 */
static uint16_t tkl_dev_appearance = 0x0000;    //Generic Unknown

/*
 * GLOBAL VARIABLE DEFINITIONS
 ****************************************************************************************
 */
struct tkl_adp_env_tag adp_env = {0};
static TKL_BLE_GAP_EVT_FUNC_CB gap_evt_cb = NULL;
static TKL_BLE_GATT_EVT_FUNC_CB gatt_evt_cb = NULL;
/*
 * LOCAL FUNCTION DEFINITIONS
 ****************************************************************************************
 */

/*
 * Adapter Application
 ****************************************************************************************
 */
static void tkl_app_adapter_cfg(void)
{
    ble_adp_config_t cfg = {0};

    cfg.keys_user_mgr = false;
    // Set the operation
    if (adp_env.role & TKL_BLE_ROLE_SERVER) {
        cfg.role |= BLE_GAP_ROLE_PERIPHERAL;
    }

    if (adp_env.role & TKL_BLE_ROLE_CLIENT) {
        cfg.role |= BLE_GAP_ROLE_CENTRAL;
    }

    cfg.pairing_mode = BLE_GAP_PAIRING_SECURE_CONNECTION | BLE_GAP_PAIRING_LEGACY;

    cfg.att_cfg = 0;
    SETF(cfg.att_cfg, BLE_GAP_ATT_CLI_DIS_AUTO_MTU_EXCH, 1);
    SETF(cfg.att_cfg, BLE_GAP_ATT_CLI_DIS_AUTO_FEAT_EN, 1);
    SETF(cfg.att_cfg, BLE_GAP_ATT_CLI_DIS_AUTO_EATT, 1);

    SETF(cfg.att_cfg, BLE_GAP_ATT_SLV_PREF_CON_PAR_EN, 1);
    SETF(cfg.att_cfg, BLE_GAP_ATT_NAME_PERM, BLE_GAP_WRITE_NOT_ENC);
    SETF(cfg.att_cfg, BLE_GAP_ATT_APPEARENCE_PERM, BLE_GAP_WRITE_NOT_ENC);

    cfg.privacy_cfg = BLE_GAP_PRIV_CFG_PRIV_EN_BIT;

    ble_adp_cfg(&cfg);
}

static void tkl_ble_adp_evt_handler(ble_adp_evt_t event, ble_adp_data_u *p_data)
{
    uint8_t i = 0;
    switch (event) {
    case BLE_ADP_EVT_RESET_CMPL_INFO:
        tkl_app_adapter_cfg();
        break;

    case BLE_ADP_EVT_ENABLE_CMPL_INFO: {
        TKL_BLE_GAP_PARAMS_EVT_T params_evt;

        params_evt.type = TKL_BLE_EVT_STACK_INIT;
        if (p_data->adapter_info.status == BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "=== Adapter enable success ===\r\n");
            dbg_print(INFO, "hci_ver 0x%x, hci_subver 0x%x, lmp_ver 0x%x, lmp_subver 0x%x, manuf_name 0x%x\r\n",
                   p_data->adapter_info.version.hci_ver, p_data->adapter_info.version.hci_subver,
                   p_data->adapter_info.version.lmp_ver, p_data->adapter_info.version.lmp_subver,
                   p_data->adapter_info.version.manuf_name);

            dbg_print(INFO, "adv_set_num %u, min_tx_pwr %d, max_tx_pwr %d, max_adv_data_len %d \r\n",
                   p_data->adapter_info.adv_set_num, p_data->adapter_info.tx_pwr_range.min_tx_pwr,
                   p_data->adapter_info.tx_pwr_range.max_tx_pwr, p_data->adapter_info.max_adv_data_len);
            dbg_print(INFO, "sugg_max_tx_octets %u, sugg_max_tx_time %u \r\n",
                   p_data->adapter_info.sugg_dft_data.sugg_max_tx_octets,
                   p_data->adapter_info.sugg_dft_data.sugg_max_tx_time);

            dbg_print(INFO, "loc irk:");

            for (i = 0; i < BLE_GAP_KEY_LEN; i++) {
                dbg_print(INFO, " %02x", p_data->adapter_info.loc_irk_info.irk[i]);
            }

            dbg_print(INFO, "\r\n");
            dbg_print(INFO, "identity addr %02X:%02X:%02X:%02X:%02X:%02X \r\n ",
                   p_data->adapter_info.loc_irk_info.identity.addr[5],
                   p_data->adapter_info.loc_irk_info.identity.addr[4],
                   p_data->adapter_info.loc_irk_info.identity.addr[3],
                   p_data->adapter_info.loc_irk_info.identity.addr[2],
                   p_data->adapter_info.loc_irk_info.identity.addr[1],
                   p_data->adapter_info.loc_irk_info.identity.addr[0]);

            dbg_print(NOTICE, "=== Tuya BLE Adapter enable complete ===\r\n");

            params_evt.result = OPRT_OK;
        }
        else {
            params_evt.result = OPRT_OS_ADAPTER_BLE_INIT_FAILED;
        }

