NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
        if (gap_evt_cb) {
            gap_evt_cb(&params_evt);
        }
    } break;

    default:
        break;
    }
}

/*
 * Scan Application
 ****************************************************************************************
 */
static void tkl_ble_app_scan_mgr_evt_handler(ble_scan_evt_t scan_event, ble_scan_data_u *p_data)
{
    TKL_BLE_GAP_PARAMS_EVT_T event;
    switch (scan_event) {
    case BLE_SCAN_EVT_STATE_CHG:
        if (p_data->scan_state.scan_state == BLE_SCAN_STATE_ENABLED) {
            dbg_print(NOTICE, "Ble Scan enabled status 0x%x\r\n", p_data->scan_state.reason);
        }
        else if (p_data->scan_state.scan_state == BLE_SCAN_STATE_DISABLED) {
            dbg_print(NOTICE, "Ble Scan disabled  status 0x%x\r\n", p_data->scan_state.reason);
        }
        break;

    case BLE_SCAN_EVT_ADV_RPT:
    {
        event.type = TKL_BLE_GAP_EVT_ADV_REPORT;
        event.result = OPRT_OK;

        if (p_data->p_adv_rpt->type.extended_pdu) {
            event.gap_event.adv_report.adv_type = TKL_BLE_EXTENDED_ADV_DATA;
        }
        else {
            if (p_data->p_adv_rpt->type.scan_response) {
                event.gap_event.adv_report.adv_type = TKL_BLE_RSP_DATA;
            }
            else if (p_data->p_adv_rpt->type.connectable) {
                event.gap_event.adv_report.adv_type = TKL_BLE_ADV_DATA;
            }
            else {
                event.gap_event.adv_report.adv_type = TKL_BLE_NONCONN_ADV_DATA;
            }
        }
        event.gap_event.adv_report.peer_addr.type = p_data->p_adv_rpt->peer_addr.addr_type;
        sys_memcpy(event.gap_event.adv_report.peer_addr.addr, p_data->p_adv_rpt->peer_addr.addr, 6);

        event.gap_event.adv_report.rssi = p_data->p_adv_rpt->rssi;
        event.gap_event.adv_report.channel_index = 0xFF;
        event.gap_event.adv_report.data.length = p_data->p_adv_rpt->data.len;
        event.gap_event.adv_report.data.p_data = p_data->p_adv_rpt->data.p_data;

        if (gap_evt_cb)
            gap_evt_cb(&event);
    }
    break;
    }
}

static void handle_scan_msg(uint8_t type, ble_scan_info_t *p_scan_info)
{
    switch(type) {
    case SCAN_SUBTYPE_DISABLE: {
        ble_scan_disable();
    } break;

    case SCAN_SUBTYPE_ENABLE: {
        ble_gap_scan_param_t param;

        param.type = BLE_GAP_SCAN_TYPE_GEN_DISC;
        param.prop = 0;

        if (p_scan_info->params.scan_phys == TKL_BLE_GAP_PHY_AUTO) {
            param.prop |= (BLE_GAP_SCAN_PROP_PHY_1M_BIT | BLE_GAP_SCAN_PROP_ACTIVE_CODED_BIT);
        }
        else {
            if (p_scan_info->params.scan_phys & TKL_BLE_GAP_PHY_1MBPS) {
                param.prop |= BLE_GAP_SCAN_PROP_PHY_1M_BIT;
                if (p_scan_info->params.active) {
                     param.prop |= BLE_GAP_SCAN_PROP_ACTIVE_1M_BIT;
                }
            }

            if (p_scan_info->params.scan_phys & TKL_BLE_GAP_PHY_CODED) {
                param.prop |= BLE_GAP_SCAN_PROP_ACTIVE_CODED_BIT;
                if (p_scan_info->params.active) {
                     param.prop |= BLE_GAP_SCAN_PROP_ACTIVE_CODED_BIT;
                }
            }
        }

        param.dup_filt_pol = BLE_GAP_DUP_FILT_EN;

        param.scan_intv_1m    = p_scan_info->params.interval;
        param.scan_intv_coded = p_scan_info->params.interval;
        param.scan_win_1m    = p_scan_info->params.window;
        param.scan_win_coded = p_scan_info->params.window;
        param.duration = p_scan_info->params.timeout;
        param.period   = 0;

        ble_scan_param_set(&param);
        ble_scan_enable();

    } break;

    default:
      break;
    }
}

/*
 * Security Application
 ****************************************************************************************
 */
static void tkl_ble_app_sec_evt_handler(ble_sec_evt_t event, ble_sec_data_u *p_data)
{

    switch (event) {
    case BLE_SEC_EVT_PAIRING_REQ_IND:
        ble_sec_pairing_req_cfm(p_data->pairing_req_ind.conn_idx, false, NULL, 0);
        break;

    case BLE_SEC_EVT_LTK_REQ_IND:
        ble_sec_ltk_req_cfm(p_data->ltk_req_ind.conn_idx, false, NULL);
        break;

    case BLE_SEC_EVT_KEY_DISPLAY_REQ_IND:
        ble_sec_key_display_enter_cfm(p_data->tk_req_ind.conn_idx, false, 0);
        break;

    case BLE_SEC_EVT_KEY_ENTER_REQ_IND:
        ble_sec_key_display_enter_cfm(p_data->tk_req_ind.conn_idx, false, 0);
        break;

    case BLE_SEC_EVT_KEY_OOB_REQ_IND:
        ble_sec_oob_req_cfm(p_data->tk_req_ind.conn_idx, false, NULL);
        break;

    case BLE_SEC_EVT_NUMERIC_COMPARISON_IND:
        ble_sec_nc_cfm(p_data->nc_ind.conn_idx, false);
        break;

    case BLE_SEC_EVT_IRK_REQ_IND:
        ble_sec_irk_req_cfm(p_data->irk_req_ind.conn_idx, false, NULL);
        break;

    case BLE_SEC_EVT_CSRK_REQ_IND:
        ble_sec_csrk_req_cfm(p_data->csrk_req_ind.conn_idx, false, NULL);
        break;

    case BLE_SEC_EVT_OOB_DATA_REQ_IND:
        ble_sec_oob_data_req_cfm(p_data->oob_data_req_ind.conn_idx, false, NULL, NULL);
        break;

    case BLE_SEC_EVT_PAIRING_SUCCESS_INFO:
        break;

    case BLE_SEC_EVT_PAIRING_FAIL_INFO:
        break;

    case BLE_SEC_EVT_SECURITY_REQ_INFO:
        break;

    case BLE_SEC_EVT_ENCRYPT_REQ_IND:
        ble_sec_encrypt_req_cfm(p_data->enc_req_ind.conn_idx, false, NULL, 0);
        break;

    case BLE_SEC_EVT_ENCRYPT_INFO:
        break;

    case BLE_SEC_EVT_OOB_DATA_GEN_INFO:
        break;

    case BLE_SEC_EVT_KEY_PRESS_INFO:
        dbg_print(NOTICE, "conidx %u key press info type %d\r\n", p_data->key_press_info.conn_idx,
               p_data->key_press_info.type);
        break;
    default:
        break;
    }
}


/*
 * Connection Application
 ****************************************************************************************
 */
static tkl_conn_dev_node_t *tkl_ble_find_dev_by_conidx(uint8_t conidx)
{
    dlist_t *pos, *n;
    tkl_conn_dev_node_t *p_device = NULL;

    if (list_empty(&adp_env.conn_dev_list)) {
        return NULL;
    }

    list_for_each_safe(pos, n, &adp_env.conn_dev_list) {
        p_device = list_entry(pos, tkl_conn_dev_node_t, list);
        if (p_device->conidx == conidx) {
            return p_device;
        }
    }

