NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
    return NULL;
}

static tkl_conn_dev_node_t *tkl_ble_find_dev_by_conn_handle(uint16_t conn_handle)
{
    dlist_t *pos, *n;
    tkl_conn_dev_node_t *p_device = NULL;

    if (list_empty(&adp_env.conn_dev_list)) {
        return NULL;
    }

    list_for_each_safe(pos, n, &adp_env.conn_dev_list) {
        p_device = list_entry(pos, tkl_conn_dev_node_t, list);
        if (p_device->conn_handle == conn_handle) {
            return p_device;
        }
    }

    return NULL;
}

static tkl_conn_dev_node_t *tkl_ble_alloc_dev_by_conn_handle(uint16_t conn_handle)
{
    tkl_conn_dev_node_t *p_device = NULL;

    p_device = (tkl_conn_dev_node_t *)sys_malloc(sizeof(tkl_conn_dev_node_t));

    if (p_device == NULL) {
        return NULL;
    }
    sys_memset(p_device, 0, sizeof(tkl_conn_dev_node_t));

    INIT_DLIST_HEAD(&p_device->list);

    p_device->conn_handle = conn_handle;

    list_add_tail(&p_device->list, &adp_env.conn_dev_list);
    return p_device;
}

static tkl_conn_dev_node_t *tkl_ble_find_alloc_dev_by_conn_handle(uint16_t conn_handle)
{
    tkl_conn_dev_node_t *p_device = tkl_ble_find_dev_by_conn_handle(conn_handle);

    if (p_device != NULL) {
        return p_device;
    }

    p_device = tkl_ble_alloc_dev_by_conn_handle(conn_handle);
    return p_device;
}

static void tkl_ble_remove_dev_by_conn_handle(uint16_t conn_handle)
{
    tkl_conn_dev_node_t *p_device = tkl_ble_find_dev_by_conn_handle(conn_handle);

    if (p_device != NULL) {
        list_del(&p_device->list);
        sys_mfree(p_device);
    }

}

static void tkl_ble_app_conn_evt_handler(ble_conn_evt_t event, ble_conn_data_u *p_data)
{
    switch (event) {
    case BLE_CONN_EVT_INIT_STATE_CHG: {
        if (p_data->init_state.state == BLE_INIT_STATE_IDLE) {
            dbg_print(NOTICE, "===> init conn idle idx %u, wl_used %d reason 0x%x\r\n",
                   p_data->init_state.init_idx, p_data->init_state.wl_used, p_data->init_state.reason);
        } else if (p_data->init_state.state == BLE_INIT_STATE_STARTING) {
            dbg_print(NOTICE, "===> init conn starting idx %u, wl_used %d\r\n",
                   p_data->init_state.init_idx, p_data->init_state.wl_used);
        } else if (p_data->init_state.state == BLE_INIT_STATE_STARTED) {
            dbg_print(NOTICE, "===> init conn started idx %u, wl_used %d\r\n",
                   p_data->init_state.init_idx, p_data->init_state.wl_used);
        } else if (p_data->init_state.state == BLE_INIT_STATE_DISABLING) {
            dbg_print(NOTICE, "===> init conn disabling idx %u, wl_used %d reason 0x%x\r\n",
                   p_data->init_state.init_idx, p_data->init_state.wl_used, p_data->init_state.reason);
            // Disabling state with reason is not BLE_ERR_NO_ERROR which means init connecting not clear completely.
            // Needs to call ble_conn_connect_cancel again
            if (p_data->init_state.reason != BLE_ERR_NO_ERROR) {
                if (ble_conn_connect_cancel() != BLE_ERR_NO_ERROR) {
                    dbg_print(NOTICE, "===> init conn disabling idx %u, cancel connecting fail!\r\n",
                           p_data->init_state.init_idx);
                }
            }
        }
    }
    break;

    case BLE_CONN_EVT_STATE_CHG: {
        TKL_BLE_GAP_PARAMS_EVT_T params_evt;

        if (p_data->conn_state.state == BLE_CONN_STATE_DISCONNECTD) {
            dbg_print(NOTICE, "disconnected. conn idx: %u, conn_hdl: 0x%x reason 0x%x\r\n",
                   p_data->conn_state.info.discon_info.conn_idx, p_data->conn_state.info.discon_info.conn_hdl,
                   p_data->conn_state.info.discon_info.reason);

            tkl_conn_dev_node_t *p_dev = tkl_ble_find_dev_by_conn_handle(p_data->conn_state.info.discon_info.conn_hdl);

            if (p_dev) {
                params_evt.type = TKL_BLE_GAP_EVT_DISCONNECT;
                params_evt.conn_handle = p_data->conn_state.info.discon_info.conn_hdl;
                params_evt.result = OPRT_OK;
                params_evt.gap_event.disconnect.role = p_dev->role;
                params_evt.gap_event.disconnect.reason = p_data->conn_state.info.discon_info.reason;

                if (gap_evt_cb) {
                    gap_evt_cb(&params_evt);
                }
            }
        } else if (p_data->conn_state.state == BLE_CONN_STATE_CONNECTED) {
            tkl_conn_dev_node_t *p_dev = tkl_ble_find_alloc_dev_by_conn_handle(p_data->conn_state.info.conn_info.conn_hdl);

            if (p_dev) {
                p_dev->conidx = p_data->conn_state.info.conn_info.conn_idx;
                p_dev->role = p_data->conn_state.info.conn_info.role == 0 ? TKL_BLE_ROLE_CLIENT : TKL_BLE_ROLE_SERVER;
            }

            params_evt.type = TKL_BLE_GAP_EVT_CONNECT;
            params_evt.conn_handle = p_data->conn_state.info.conn_info.conn_hdl;
            params_evt.result = OPRT_OK;
            params_evt.gap_event.connect.role = p_data->conn_state.info.conn_info.role == 0 ? TKL_BLE_ROLE_CLIENT : TKL_BLE_ROLE_SERVER;
            params_evt.gap_event.connect.peer_addr.type = p_data->conn_state.info.conn_info.peer_addr.addr_type;
            sys_memcpy(params_evt.gap_event.connect.peer_addr.addr, p_data->conn_state.info.conn_info.peer_addr.addr, BLE_GAP_ADDR_LEN);
            params_evt.gap_event.connect.conn_params.conn_interval_min = p_data->conn_state.info.conn_info.con_interval;
            params_evt.gap_event.connect.conn_params.conn_interval_max = p_data->conn_state.info.conn_info.con_interval;
            params_evt.gap_event.connect.conn_params.conn_latency = p_data->conn_state.info.conn_info.con_latency;
            params_evt.gap_event.connect.conn_params.conn_sup_timeout = p_data->conn_state.info.conn_info.sup_to;

            if (gap_evt_cb) {
                gap_evt_cb(&params_evt);
            }

        }
    }
    break;

    case BLE_CONN_EVT_DISCONN_FAIL: {
        dbg_print(NOTICE, "disconnect fail. conn idx %u, reason 0x%x\r\n",
                  p_data->disconn_fail.conn_idx, p_data->disconn_fail.reason);
    }
    break;

    case BLE_CONN_EVT_PEER_NAME_GET_RSP: {
        if (p_data->peer_name.status == BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "conn idx: %u, peer name: %s\r\n",
                   p_data->peer_name.conn_idx, p_data->peer_name.p_name);
        }
    }
    break;

    case BLE_CONN_EVT_PEER_VERSION_GET_RSP: {
        if (p_data->peer_version.status == BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "conn idx: %u, peer version: 0x%x, subversion: 0x%x, comp id 0x%x\r\n",
                   p_data->peer_version.conn_idx,
                   p_data->peer_version.lmp_version, p_data->peer_version.lmp_subversion,
                   p_data->peer_version.company_id);
        }
    }
    break;

