NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
    case BLE_CONN_EVT_PEER_FEATS_GET_RSP: {
        if (p_data->peer_features.status == BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "conn idx: %u, peer feature: 0x%02x%02x%02x%02x%02x%02x%02x%02x\r\n",
                   p_data->peer_features.conn_idx,
                   p_data->peer_features.features[7], p_data->peer_features.features[6],
                   p_data->peer_features.features[5], p_data->peer_features.features[4],
                   p_data->peer_features.features[3], p_data->peer_features.features[2],
                   p_data->peer_features.features[1], p_data->peer_features.features[0]);
        }
    }
    break;

    case BLE_CONN_EVT_PEER_APPEARANCE_GET_RSP: {
        if (p_data->peer_appearance.status == BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "conn idx: %u, peer appearance: 0x%x\r\n", p_data->peer_appearance.conn_idx,
                   p_data->peer_appearance.appearance);
        }
    }
    break;

    case BLE_CONN_EVT_PEER_SLV_PRF_PARAM_GET_RSP: {
        if (p_data->peer_slv_prf_param.status == BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "conn idx: %u, conn_intv_min: 0x%x, conn_intv_max: 0x%x, latency: %d, timeout: %d\r\n",
                   p_data->peer_slv_prf_param.conn_idx,
                   p_data->peer_slv_prf_param.conn_intv_min, p_data->peer_slv_prf_param.conn_intv_max,
                   p_data->peer_slv_prf_param.latency,
                   p_data->peer_slv_prf_param.conn_timeout);
        }
    }
    break;

    case BLE_CONN_EVT_PEER_ADDR_RESLV_GET_RSP: {
        if (p_data->peer_addr_reslv_sup.status == BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "conn idx: %u, central address resolution support %d\r\n", p_data->peer_addr_reslv_sup.conn_idx,
                   p_data->peer_addr_reslv_sup.ctl_addr_resol);
        }
    }
    break;

    case BLE_CONN_EVT_PEER_RPA_ONLY_GET_RSP: {
        if (p_data->rpa_only.status == BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "conn idx: %u, central rpa only %d\r\n", p_data->rpa_only.conn_idx,
                   p_data->rpa_only.rpa_only);
        }
    }
    break;

    case BLE_CONN_EVT_PEER_DB_HASH_GET_RSP: {
        if (p_data->db_hash.status == BLE_ERR_NO_ERROR) {
            uint8_t i;
            dbg_print(NOTICE, "conn idx: %u, db_hash\r\n", p_data->db_hash.conn_idx);
            for (i = 0; i < 16; i++) {
                dbg_print(NOTICE, "%02x", p_data->db_hash.hash[i]);
            }

            dbg_print(NOTICE, "\r\n");
        }
    }
    break;

    case BLE_CONN_EVT_PING_TO_VAL_GET_RSP: {
        if (p_data->ping_to_val.status == BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "conn idx %u ping timeout %d\r\n", p_data->ping_to_val.conn_idx,
                   p_data->ping_to_val.ping_tout);
        }
    }
    break;

    case BLE_CONN_EVT_PING_TO_INFO: {
        dbg_print(NOTICE, "conn idx %u ping timeout\r\n", p_data->ping_timeout.conn_idx);
    }
    break;

    case BLE_CONN_EVT_PING_TO_SET_RSP: {
        dbg_print(NOTICE, "conn idx %u ping timeout set status 0x%x\r\n", p_data->ping_to_set.conn_idx,
               p_data->ping_to_set.status);
    }
    break;

    case BLE_CONN_EVT_RSSI_GET_RSP: {
        TKL_BLE_GAP_PARAMS_EVT_T params_evt;
        tkl_conn_dev_node_t *p_dev = tkl_ble_find_dev_by_conidx(p_data->rssi_ind.conn_idx);

        if (p_dev == NULL) {
            break;
        }

        dbg_print(NOTICE, "conn idx %u rssi: %d\r\n", p_data->rssi_ind.conn_idx, p_data->rssi_ind.rssi);

        params_evt.type = TKL_BLE_GAP_EVT_CONN_RSSI;
        params_evt.conn_handle = p_dev->conn_handle;

        if (p_data->rssi_ind.status != BLE_ERR_NO_ERROR) {
            params_evt.result = OPRT_OS_ADAPTER_BLE_RESERVED1;
        }
        else {
            params_evt.result = OPRT_OK;
            params_evt.gap_event.link_rssi = p_data->rssi_ind.rssi;
        }
        if (gap_evt_cb) {
            gap_evt_cb(&params_evt);
        }
    }
    break;

    case BLE_CONN_EVT_CHANN_MAP_GET_RSP: {
        dbg_print(NOTICE, "channel map: 0x%02x%02x%02x%02x%02x\r\n", p_data->chnl_map_ind.chann_map[4],
               p_data->chnl_map_ind.chann_map[3], p_data->chnl_map_ind.chann_map[2],
               p_data->chnl_map_ind.chann_map[1], p_data->chnl_map_ind.chann_map[0]);
    }
    break;

    case BLE_CONN_EVT_NAME_GET_IND: {
        ble_conn_name_get_cfm(p_data->name_get_ind.conn_idx, BLE_GAP_ERR_NOT_SUPPORTED, p_data->name_get_ind.token,
                              0, NULL, 0);
    }
    break;

    case BLE_CONN_EVT_APPEARANCE_GET_IND: {
        dbg_print(NOTICE, "conn idx %u appearance acquire \r\n", p_data->appearance_get_ind.conn_idx);

        ble_conn_appearance_get_cfm(p_data->appearance_get_ind.conn_idx, BLE_ERR_NO_ERROR,
                                    p_data->appearance_get_ind.token, tkl_dev_appearance);
    }
    break;

    case BLE_CONN_EVT_SLAVE_PREFER_PARAM_GET_IND: {
        ble_gap_slave_prefer_param_t param;

        dbg_print(NOTICE, "conn idx %u slave prefer parameters acquire \r\n",
               p_data->slave_prefer_param_get_ind.conn_idx);

        param.conn_intv_min = 8;
        param.conn_intv_max = 10;
        param.latency = 0;
        param.conn_tout = 200;  //2s

        ble_conn_slave_prefer_param_get_cfm(p_data->slave_prefer_param_get_ind.conn_idx, BLE_ERR_NO_ERROR,
                                            p_data->slave_prefer_param_get_ind.token, &param);
    }
    break;

    case BLE_CONN_EVT_NAME_SET_IND: {
        ble_adp_name_set(p_data->name_set_ind.p_name, p_data->name_set_ind.name_len);

        dbg_print(NOTICE, "conn idx %u, name set %s, name len %u \r\n",
               p_data->name_set_ind.conn_idx, p_data->name_set_ind.p_name,
               p_data->name_set_ind.name_len);

        ble_conn_name_set_cfm(p_data->name_set_ind.conn_idx, BLE_ERR_NO_ERROR, p_data->name_set_ind.token);
    }
    break;

    case BLE_CONN_EVT_APPEARANCE_SET_IND: {
        tkl_dev_appearance = p_data->appearance_set_ind.appearance;

        dbg_print(NOTICE, "conn idx %u, appearance set 0x%x\r\n", p_data->appearance_set_ind.conn_idx,
               p_data->appearance_set_ind.appearance);

