NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
        ble_conn_appearance_set_cfm(p_data->appearance_set_ind.conn_idx, BLE_ERR_NO_ERROR,
                                    p_data->appearance_set_ind.token);
    }
    break;

    case BLE_CONN_EVT_PARAM_UPDATE_IND: {
        dbg_print(NOTICE, "conn idx %u, intv_min 0x%x, intv_max 0x%x, latency %u, supv_tout %u\r\n",
               p_data->conn_param_req_ind.conn_idx, p_data->conn_param_req_ind.intv_min,
               p_data->conn_param_req_ind.intv_max, p_data->conn_param_req_ind.latency,
               p_data->conn_param_req_ind.supv_tout);

        if(p_data->conn_param_req_ind.intv_max < p_data->conn_param_req_ind.intv_min) {
            ble_conn_param_update_cfm(p_data->conn_param_req_ind.conn_idx, false, 0, 0);
        } else {
            TKL_BLE_GAP_PARAMS_EVT_T params_evt;
            tkl_conn_dev_node_t *p_dev = tkl_ble_find_dev_by_conidx(p_data->conn_param_req_ind.conn_idx);

            if (p_dev == NULL) {
                break;
            }

            params_evt.type = TKL_BLE_GAP_EVT_CONN_PARAM_REQ;
            params_evt.conn_handle = p_dev->conn_handle;
            params_evt.gap_event.conn_param.conn_interval_min = p_data->conn_param_req_ind.intv_min;
            params_evt.gap_event.conn_param.conn_interval_max = p_data->conn_param_req_ind.intv_max;
            params_evt.gap_event.conn_param.conn_latency = p_data->conn_param_req_ind.latency;
            params_evt.gap_event.conn_param.conn_sup_timeout = p_data->conn_param_req_ind.supv_tout;

            if (gap_evt_cb) {
                gap_evt_cb(&params_evt);
            }

            ble_conn_param_update_cfm(p_data->conn_param_req_ind.conn_idx, true, 0, 0);
        }
    }
    break;

    case BLE_CONN_EVT_PARAM_UPDATE_RSP: {
        dbg_print(NOTICE, "conn idx %u, param update result status: 0x%x\r\n",
               p_data->conn_param_rsp.conn_idx, p_data->conn_param_rsp.status);

    }
    break;

    case BLE_CONN_EVT_PARAM_UPDATE_INFO: {
        TKL_BLE_GAP_PARAMS_EVT_T params_evt;
        tkl_conn_dev_node_t *p_dev = tkl_ble_find_dev_by_conidx(p_data->conn_params.conn_idx);

        if (p_dev == NULL) {
            break;
        }

        dbg_print(NOTICE, "conn idx %u, param update ind: interval %d, latency %d, sup to %d\r\n",
               p_data->conn_params.conn_idx,
               p_data->conn_params.interval, p_data->conn_params.latency, p_data->conn_params.supv_tout);

        params_evt.type = TKL_BLE_GAP_EVT_CONN_PARAM_UPDATE;
        params_evt.result = OPRT_OK;
        params_evt.conn_handle = p_dev->conn_handle;
        params_evt.gap_event.conn_param.conn_interval_min = p_data->conn_params.interval;
        params_evt.gap_event.conn_param.conn_interval_max = p_data->conn_params.interval;
        params_evt.gap_event.conn_param.conn_latency = p_data->conn_params.latency;
        params_evt.gap_event.conn_param.conn_sup_timeout = p_data->conn_params.supv_tout;

        if (gap_evt_cb) {
            gap_evt_cb(&params_evt);
        }
    }
    break;

    case BLE_CONN_EVT_PKT_SIZE_SET_RSP: {
        dbg_print(NOTICE, "conn idx %u, packet size set status 0x%x\r\n",
               p_data->pkt_size_set_rsp.conn_idx, p_data->pkt_size_set_rsp.status);
    }
    break;

    case BLE_CONN_EVT_PKT_SIZE_INFO: {
        dbg_print(NOTICE, "le pkt size info: conn idx %u, tx oct %d, tx time %d, rx oct %d, rx time %d\r\n",
               p_data->pkt_size_info.conn_idx, p_data->pkt_size_info.max_tx_octets,
               p_data->pkt_size_info.max_tx_time,
               p_data->pkt_size_info.max_rx_octets, p_data->pkt_size_info.max_rx_time);
    }
    break;

    case BLE_CONN_EVT_PHY_GET_RSP: {
        dbg_print(NOTICE, "conn idx %u le phy get status 0x%x\r\n", p_data->phy_get.conn_idx,
               p_data->phy_get.status);
    }
    break;

    case BLE_CONN_EVT_PHY_SET_RSP: {
        dbg_print(NOTICE, "conn idx %u le phy set status 0x%x\r\n", p_data->phy_set.conn_idx,
               p_data->phy_set.status);
    }
    break;

    case BLE_CONN_EVT_PHY_INFO: {
        dbg_print(NOTICE, "le phy ind conn idx %u: tx phy 0x%x, rx phy 0x%x\r\n", p_data->phy_val.conn_idx,
               p_data->phy_val.tx_phy, p_data->phy_val.rx_phy);
    }
    break;

    case BLE_CONN_EVT_LOC_TX_PWR_GET_RSP: {
        dbg_print(NOTICE, "local tx pwr conn idx %u, phy %d, pwr %d, max %d\r\n", p_data->loc_tx_pwr.conn_idx,
               p_data->loc_tx_pwr.phy, p_data->loc_tx_pwr.tx_pwr, p_data->loc_tx_pwr.max_tx_pwr);
    }
    break;

    case BLE_CONN_EVT_PEER_TX_PWR_GET_RSP: {
        dbg_print(NOTICE, "peer tx pwr conidx %u, pwr %d, flag 0x%x \r\n", p_data->peer_tx_pwr.conn_idx,
               p_data->peer_tx_pwr.tx_pwr, p_data->peer_tx_pwr.flags);
    }
    break;

    case BLE_CONN_EVT_LOC_TX_PWR_RPT_INFO: {
        dbg_print(NOTICE, "local tx pwr report conn idx %u, phy %d, pwr %d, flag 0x%x, delta %d\r\n",
               p_data->loc_tx_pwr_rpt.conn_idx, p_data->loc_tx_pwr_rpt.phy, p_data->loc_tx_pwr_rpt.tx_pwr,
               p_data->loc_tx_pwr_rpt.flags, p_data->loc_tx_pwr_rpt.delta);
    }
    break;

    case BLE_CONN_EVT_PEER_TX_PWR_RPT_INFO: {
        dbg_print(NOTICE, "peer tx pwr report conn idx %u, phy %d, pwr %d, flag 0x%x, delta %d\r\n",
               p_data->peer_tx_pwr_rpt.conn_idx, p_data->loc_tx_pwr_rpt.phy, p_data->loc_tx_pwr_rpt.tx_pwr,
               p_data->loc_tx_pwr_rpt.flags, p_data->loc_tx_pwr_rpt.delta);
    }
    break;

    case BLE_CONN_EVT_PATH_LOSS_THRESHOLD_INFO: {
        dbg_print(NOTICE, "path loss threshold conn idx %u, curr %d, zone %d\r\n",
               p_data->loc_tx_pwr_rpt.conn_idx, p_data->path_loss_thr.curr_path_loss,
               p_data->path_loss_thr.zone_entered);
    }
    break;

    case BLE_CONN_EVT_PATH_LOSS_CTRL_RSP: {
        dbg_print(NOTICE, "path loss ctrl conn idx %u, status 0x%x\r\n",
               p_data->path_ctrl.conn_idx, p_data->path_ctrl.status);
    }
    break;

    case BLE_CONN_EVT_PER_SYNC_TRANS_RSP: {
        dbg_print(NOTICE, "periodic sync transfer result conn idx %u, status 0x%x\r\n",
               p_data->sync_trans_rsp.conn_idx, p_data->sync_trans_rsp.status);
    }
    break;

