NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
    case BLE_CONN_EVT_TX_PWR_RPT_CTRL_RSP: {
        dbg_print(NOTICE, "Tx power report contrl result conn idx %u, status 0x%x\r\n",
               p_data->tx_pwr_rpt_ctrl_rsp.conn_idx, p_data->tx_pwr_rpt_ctrl_rsp.status);
    }
    break;

    default:
        break;
    }
}

static void handle_conn_msg(uint8_t type, ble_conn_info_t *p_conn_info)
{
    tkl_conn_dev_node_t *p_dev = tkl_ble_find_dev_by_conn_handle(p_conn_info->conn_handle);

    if (p_dev == NULL && type != CONN_SUBTYPE_CONN) {
        return;
    }

    switch(type) {
    case CONN_SUBTYPE_DISCON: {
        if (ble_conn_disconnect(p_dev->conidx, BLE_ERROR_HL_TO_HCI(p_conn_info->data.disconn_reason)) != BLE_ERR_NO_ERROR) {
            app_print("disconnect connection fail \r\n");
        }

    } break;

    case CONN_SUBTYPE_CONN: {
        ble_gap_init_param_t param;
        ble_gap_addr_t peer_addr_info;
        ble_init_data_t *p_conn_data = &p_conn_info->data.conn_params;

        param.type = BLE_GAP_INIT_TYPE_DIRECT_CONN_EST;

        param.prop = BLE_GAP_INIT_PROP_1M_BIT | BLE_GAP_INIT_PROP_2M_BIT |
                                     BLE_GAP_INIT_PROP_CODED_BIT;
        param.conn_tout = p_conn_data->conn_params.connection_timeout;

        param.scan_intv_1m      = p_conn_data->scan_params.interval;
        param.scan_win_1m       = p_conn_data->scan_params.window;
        param.scan_intv_coded   = p_conn_data->scan_params.interval;
        param.scan_win_coded    = p_conn_data->scan_params.window;

        param.conn_param_1m.conn_intv_min   = p_conn_data->conn_params.conn_interval_min;
        param.conn_param_1m.conn_intv_max   = p_conn_data->conn_params.conn_interval_max;
        param.conn_param_1m.conn_latency    = p_conn_data->conn_params.conn_latency;
        param.conn_param_1m.supv_tout       = p_conn_data->conn_params.conn_sup_timeout;
        param.conn_param_1m.ce_len_min      = 0;
        param.conn_param_1m.ce_len_max      = 0;

        param.conn_param_2m.conn_intv_min   = p_conn_data->conn_params.conn_interval_min;
        param.conn_param_2m.conn_intv_max   = p_conn_data->conn_params.conn_interval_max;
        param.conn_param_2m.conn_latency    = p_conn_data->conn_params.conn_latency;
        param.conn_param_2m.supv_tout       = p_conn_data->conn_params.conn_sup_timeout;
        param.conn_param_2m.ce_len_min      = 0;
        param.conn_param_2m.ce_len_max      = 0;

        param.conn_param_coded.conn_intv_min   = p_conn_data->conn_params.conn_interval_min;
        param.conn_param_coded.conn_intv_max   = p_conn_data->conn_params.conn_interval_max;
        param.conn_param_coded.conn_latency    = p_conn_data->conn_params.conn_latency;
        param.conn_param_coded.supv_tout       = p_conn_data->conn_params.conn_sup_timeout;
        param.conn_param_coded.ce_len_min      = 0;
        param.conn_param_coded.ce_len_max      = 0;

        peer_addr_info.addr_type = p_conn_data->peer_addr.type;
        sys_memcpy(peer_addr_info.addr, p_conn_data->peer_addr.addr, 6);

        if (ble_conn_connect(&param, BLE_GAP_LOCAL_ADDR_STATIC, &peer_addr_info, false) != BLE_ERR_NO_ERROR) {
            app_print("connect fail\r\n");
        }

    } break;

    case CONN_SUBTYPE_CONN_PARAM_UPD: {
        TKL_BLE_GAP_CONN_PARAMS_T *p_param_data = &p_conn_info->data.conn_upd_params;

        if (ble_conn_param_update_req(p_dev->conidx, p_param_data->conn_interval_min, p_param_data->conn_interval_max,
                                      p_param_data->conn_latency, p_param_data->conn_sup_timeout, 0, 0) != BLE_ERR_NO_ERROR) {
            app_print("update param fail\r\n");
        }
    } break;

    case CONN_SUBTYPE_CONN_RSSI_GET: {
        if (ble_conn_rssi_get(p_dev->conidx) != BLE_ERR_NO_ERROR) {
            app_print("get rssi fail\r\n");
        }
    } break;

    case CONN_SUBTYPE_NAME_SET: {
        ble_adp_name_set((uint8_t *)(p_conn_info->data.p_name), strlen(p_conn_info->data.p_name));
        sys_mfree(p_conn_info->data.p_name);
    } break;

    default:
      break;
    }
}


/*
 * Advertising Application
 ****************************************************************************************
 */
static void tkl_ble_app_adv_start(tkl_adv_actv_t *p_adv)
{
    ble_adv_data_set_t adv;
    ble_adv_data_set_t scan_rsp;
    ble_adv_data_set_t per_adv;
    ble_data_t adv_data;
    ble_data_t rsp_data;
    ble_data_t per_adv_data;


    adv.data_force = true;
    adv_data.len = p_adv->p_adv->length;
    adv_data.p_data = p_adv->p_adv->data;
    adv.data.p_data_force = &adv_data;

    scan_rsp.data_force = true;
    rsp_data.len = p_adv->p_rsp->length;
    rsp_data.p_data = p_adv->p_rsp->data;
    scan_rsp.data.p_data_force = &rsp_data;

    per_adv.data_force = true;
    per_adv_data.len = 0;
    per_adv_data.p_data = NULL;
    per_adv.data.p_data_force = &per_adv_data;

    ble_adv_start(p_adv->idx, &adv, &scan_rsp, &per_adv);
}

static void tkl_ble_app_adv_mgr_evt_hdlr(ble_adv_evt_t adv_evt, void *p_data, void *p_context)
{
    tkl_adv_actv_t *p_adv = (tkl_adv_actv_t *)p_context;
    TKL_BLE_GAP_PARAMS_EVT_T event;
    event.type = TKL_BLE_GAP_EVT_ADV_STATE;

    switch (adv_evt) {
    case BLE_ADV_EVT_STATE_CHG: {
        ble_adv_state_chg_t *p_chg = (ble_adv_state_chg_t *)p_data;
        ble_adv_state_t old_state = p_adv->state;

        dbg_print(NOTICE, "adv state change 0x%x ==> 0x%x, reason 0x%x\r\n", old_state, p_chg->state, p_chg->reason);

        p_adv->state = p_chg->state;

        if ((p_chg->state == BLE_ADV_STATE_CREATE) && (old_state == BLE_ADV_STATE_CREATING)) {
            p_adv->idx = p_chg->adv_idx;
            dbg_print(NOTICE, "adv index %d\r\n", p_adv->idx);

            tkl_ble_app_adv_start(p_adv);
        } else if ((p_chg->state == BLE_ADV_STATE_CREATE) && (old_state == BLE_ADV_STATE_START)) {

            ble_adv_remove(p_adv->idx);
        } else if (p_chg->state == BLE_ADV_STATE_IDLE) {
            p_adv->idx = TKL_ADV_INVALID_IDX;
            p_adv->state = BLE_ADV_STATE_IDLE;
            event.result = TKL_BLE_GAP_ADV_STATE_IDLE;

