NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
            if (gap_evt_cb) {
               gap_evt_cb(&event);
            }
        }
        else if (p_chg->state == BLE_ADV_STATE_START) {
            event.result = TKL_BLE_GAP_ADV_STATE_ADVERTISING;

            if (gap_evt_cb) {
                gap_evt_cb(&event);
            }
        }
    } break;

    case BLE_ADV_EVT_DATA_UPDATE_RSP: {
        ble_adv_data_update_rsp_t *p_rsp = (ble_adv_data_update_rsp_t *)p_data;

        dbg_print(NOTICE, "adv data update rsp, type %d, status 0x%x\r\n", p_rsp->type, p_rsp->status);
    } break;

    default:
        break;
    }
}

static void handle_adv_msg(uint8_t type, ble_adv_info_t *p_adv_info)
{
    TKL_BLE_GAP_PARAMS_EVT_T params_evt;
    params_evt.type = TKL_BLE_GAP_EVT_ADV_STATE;

    switch(type) {
    case ADV_SUBTYPE_STOP: {
        if (adp_env.adv_info.state == BLE_ADV_STATE_START) {
            if (ble_adv_stop(adp_env.adv_info.idx) == BLE_ERR_NO_ERROR) {
                params_evt.result = TKL_BLE_GAP_ADV_STATE_STOP;
            }
            else {
                // Stop fail fix todo
                params_evt.result = TKL_BLE_GAP_ADV_STATE_ADVERTISING;
            }

            if (gap_evt_cb) {
                gap_evt_cb(&params_evt);
            }
        }
    } break;

    case ADV_SUBTYPE_START: {
        ble_adv_param_t adv_param = {0};
        TKL_BLE_GAP_ADV_PARAMS_T *p_adv_params = &(p_adv_info->data.params);

        adv_param.param.own_addr_type = BLE_GAP_LOCAL_ADDR_STATIC;
        adv_param.param.type = BLE_GAP_ADV_TYPE_LEGACY;
        adv_param.param.filter_pol = BLE_GAP_ADV_ALLOW_SCAN_ANY_CON_ANY;
        adv_param.param.disc_mode = BLE_GAP_ADV_MODE_GEN_DISC;
        adv_param.param.ch_map = p_adv_params->adv_channel_map;
        adv_param.param.primary_phy = BLE_GAP_PHY_1MBPS;
        adv_param.param.adv_sid = 0;
        adv_param.param.max_skip = 0x00;
        adv_param.param.secondary_phy = BLE_GAP_PHY_1MBPS;
        adv_param.param.peer_addr.addr_type = p_adv_params->direct_addr.type;
        sys_memcpy(adv_param.param.peer_addr.addr, p_adv_params->direct_addr.addr, 6);
        adv_param.param.adv_intv_min = p_adv_params->adv_interval_min;
        adv_param.param.adv_intv_max = p_adv_params->adv_interval_max;

        switch (p_adv_params->adv_type) {
        case TKL_BLE_GAP_ADV_TYPE_CONN_SCANNABLE_UNDIRECTED: {
            adv_param.param.prop = BLE_GAP_ADV_PROP_UNDIR_CONN;
        } break;

        case TKL_BLE_GAP_ADV_TYPE_CONN_NONSCANNABLE_DIR_HIGHDUTY_CYCLE: {
            adv_param.param.prop = BLE_GAP_ADV_PROP_HIGH_DUTY_CONN_DIRECT;
        } break;

        case TKL_BLE_GAP_ADV_TYPE_CONN_NONSCANNABLE_DIRECTED: {
            adv_param.param.prop = BLE_GAP_ADV_PROP_CONN_DIRECT;
        } break;

        case TKL_BLE_GAP_ADV_TYPE_NONCONN_SCANNABLE_UNDIRECTED: {
            adv_param.param.prop = BLE_GAP_ADV_PROP_NON_CONN_SCAN;
        } break;

        case TKL_BLE_GAP_ADV_TYPE_NONCONN_NONSCANNABLE_UNDIRECTED: {
            adv_param.param.prop = BLE_GAP_ADV_PROP_NON_CONN_NON_SCAN;
        } break;

        case TKL_BLE_GAP_ADV_TYPE_EXTENDED_CONN_NONSCANNABLE_UNDIRECTED: {
            adv_param.param.type = BLE_GAP_ADV_TYPE_EXTENDED;
            adv_param.param.prop = BLE_GAP_EXT_ADV_PROP_CONN_UNDIRECT;
        } break;

        case TKL_BLE_GAP_ADV_TYPE_EXTENDED_NONCONN_SCANNABLE_UNDIRECTED: {
            adv_param.param.type = BLE_GAP_ADV_TYPE_EXTENDED;
            adv_param.param.prop = BLE_GAP_EXT_ADV_PROP_NON_CONN_SCAN;
        } break;

        case TKL_BLE_GAP_ADV_TYPE_EXTENDED_NONCONN_SCANNABLE_DIRECTED: {
            adv_param.param.type = BLE_GAP_ADV_TYPE_EXTENDED;
            adv_param.param.prop = BLE_GAP_EXT_ADV_PROP_NON_CONN_SCAN_DIRECT;
        } break;

        case TKL_BLE_GAP_ADV_TYPE_EXTENDED_NONCONN_NONSCANNABLE_UNDIRECTED: {
            adv_param.param.type = BLE_GAP_ADV_TYPE_EXTENDED;
            adv_param.param.prop = BLE_GAP_EXT_ADV_PROP_NON_CONN_NON_SCAN;
        } break;

        case TKL_BLE_GAP_ADV_TYPE_EXTENDED_NONCONN_NONSCANNABLE_DIRECTED: {
            return;
        } break;

        }

        adp_env.adv_info.type = adv_param.param.type;
        adp_env.adv_info.disc_mode = adv_param.param.disc_mode;
        adp_env.adv_info.peer_addr = adv_param.param.peer_addr;

        if (ble_adv_create(&adv_param, tkl_ble_app_adv_mgr_evt_hdlr, &adp_env.adv_info) != BLE_ERR_NO_ERROR) {
            params_evt.result = TKL_BLE_GAP_ADV_STATE_IDLE;
        }
        else {
            params_evt.result = TKL_BLE_GAP_ADV_STATE_START;
        }

        if (gap_evt_cb) {
            gap_evt_cb(&params_evt);
        }
    } break;

    case ADV_SUBTYPE_DATA_SET: {
        if (p_adv_info->data.adv_data.p_adv_data != NULL) {
            if (adp_env.adv_info.p_adv != NULL) {
                sys_mfree(adp_env.adv_info.p_adv);
            }
            adp_env.adv_info.p_adv = p_adv_info->data.adv_data.p_adv_data;
        }

        if (p_adv_info->data.adv_data.p_rsp_data != NULL) {
            if (adp_env.adv_info.p_rsp != NULL) {
                sys_mfree(adp_env.adv_info.p_rsp);
            }
            adp_env.adv_info.p_rsp = p_adv_info->data.adv_data.p_rsp_data;
        }

    } break;

    case ADV_SUBTYPE_DATA_UPD: {
        if (adp_env.adv_info.state == BLE_ADV_STATE_START) {
            ble_adv_data_set_t adv;
            ble_adv_data_set_t *p_adv = NULL;
            ble_adv_data_set_t scan_rsp;
            ble_adv_data_set_t *p_scan_rsp = NULL;
            ble_data_t adv_data;
            ble_data_t rsp_data;
            if (p_adv_info->data.adv_data.p_adv_data != NULL) {
                if (adp_env.adv_info.p_adv != NULL) {
                    sys_mfree(adp_env.adv_info.p_adv);
                }
                adp_env.adv_info.p_adv = p_adv_info->data.adv_data.p_adv_data;
                adv.data_force = true;
                adv_data.len = adp_env.adv_info.p_adv->length;
                adv_data.p_data = adp_env.adv_info.p_adv->data;

                adv.data.p_data_force = &adv_data;
                p_adv = &adv;
            }

            if (p_adv_info->data.adv_data.p_rsp_data != NULL) {
                if (adp_env.adv_info.p_rsp != NULL) {
                    sys_mfree(adp_env.adv_info.p_rsp);
                }
                adp_env.adv_info.p_rsp = p_adv_info->data.adv_data.p_rsp_data;
                scan_rsp.data_force = true;
                rsp_data.len = adp_env.adv_info.p_rsp->length;
                rsp_data.p_data = adp_env.adv_info.p_rsp->data;

