NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
                scan_rsp.data.p_data_force = &rsp_data;
                p_scan_rsp = &scan_rsp;
            }

            ble_adv_data_update(adp_env.adv_info.idx, p_adv, p_scan_rsp, NULL);
        }
        else {
            if (p_adv_info->data.adv_data.p_adv_data != NULL) {
                sys_mfree(p_adv_info->data.adv_data.p_adv_data);
            }

            if (p_adv_info->data.adv_data.p_rsp_data != NULL) {
                sys_mfree(p_adv_info->data.adv_data.p_rsp_data);
            }
        }
    } break;

    default:
      break;
    }
}

/*
 * Gatts Application
 ****************************************************************************************
 */
static uint16_t calc_char_handle_num(TKL_BLE_SERVICE_PARAMS_T *p_service)
{
    uint8_t i;
    uint16_t total_num = 0;
    TKL_BLE_CHAR_PARAMS_T *p_cur_char = NULL;

    for (i = 0; i < p_service->char_num; i++) {
        p_cur_char = &(p_service->p_char[i]);

        total_num += 2;   // charc decl and charc value

        if (p_cur_char->property & (TKL_BLE_GATT_CHAR_PROP_NOTIFY | TKL_BLE_GATT_CHAR_PROP_INDICATE)) {
            // need cccd
            total_num++;
        }

        if (p_cur_char->property & TKL_BLE_GATT_CHAR_PROP_EXT_PROP) {
            // need cccd
            total_num++;
        }
    }

    return total_num;
}

static tkl_read_info_t* pop_front_read_op(uint8_t conn_idx)
{
    dlist_t *pos, *n;
    tkl_read_info_t *p_read_info = NULL;
    bool found = false;

    if (list_empty(&adp_env.read_list)) {
        return NULL;
    }

    list_for_each_safe(pos, n, &adp_env.read_list) {
        p_read_info = list_entry(pos, tkl_read_info_t, list);
        if (conn_idx == p_read_info->conn_idx) {
            found = true;
            break;
        }
    }

    if (found) {
        list_del(&p_read_info->list);
        return p_read_info;
    }

    return NULL;
}

static bool is_cccd(uint8_t svc_id, uint16_t cccd_handle)
{
    dlist_t *pos, *n;
    uint16_t i;
    ble_cccd_info_t *p_info = NULL;
    if (!list_empty(&adp_env.srv_cccd_list)) {
        list_for_each_safe(pos, n, &adp_env.srv_cccd_list) {
            p_info = list_entry(pos, ble_cccd_info_t, list);
            if (p_info->srv_id == svc_id) {
                for(i = 0; i < p_info->cccd_num; i++) {
                    if ((p_info->cccd_handle_tuple[i] & 0xFFFF) == cccd_handle) {
                        return true;
                    }
                }

                return false;
            }
        }
    }

    return false;
}

static uint16_t get_char_handle_by_cccd_handle(uint8_t svc_id, uint16_t cccd_handle)
{
    dlist_t *pos, *n;
    uint16_t i;
    ble_cccd_info_t *p_info = NULL;
    if (!list_empty(&adp_env.srv_cccd_list)) {
        list_for_each_safe(pos, n, &adp_env.srv_cccd_list) {
            p_info = list_entry(pos, ble_cccd_info_t, list);
            if (p_info->srv_id == svc_id) {
                for(i = 0; i < p_info->cccd_num; i++) {
                    if ((p_info->cccd_handle_tuple[i] & 0xFFFF) == cccd_handle) {
                        return (p_info->cccd_handle_tuple[i] >> 16) & 0xFFFF;
                    }
                }

                return 0;
            }
        }
    }

    return 0;
}


static ble_status_t ble_tuya_rw_cb(ble_gatts_msg_info_t *p_cb_data)
{
    uint8_t status = BLE_ERR_NO_ERROR;
    TKL_BLE_GATT_PARAMS_EVT_T event;
    uint16_t srv_handle;
    tkl_conn_dev_node_t *p_dev = NULL;

    if (p_cb_data->srv_msg_type == BLE_SRV_EVT_GATT_OPERATION) {
        p_dev = tkl_ble_find_dev_by_conidx(p_cb_data->msg_data.gatts_op_info.conn_idx);
        if (p_dev == NULL) {
            return BLE_ATT_ERR_INVALID_HANDLE;
        }

        if (p_cb_data->msg_data.gatts_op_info.gatts_op_sub_evt == BLE_SRV_EVT_READ_REQ) {
            ble_gatts_read_req_t *p_read_req = &(p_cb_data->msg_data.gatts_op_info.gatts_op_data.read_req);

            tkl_read_info_t *p_read_info = sys_malloc(sizeof(tkl_read_info_t));
            if (p_read_info == NULL) {
                status = BLE_ATT_ERR_INSUFF_RESOURCE;
            }
            else {
                p_read_req->pending_cfm = true;

                event.type = TKL_BLE_GATT_EVT_READ_CHAR_VALUE;
                event.conn_handle = p_dev->conn_handle;
                ble_gatts_get_start_hdl(p_read_req->svc_id, &srv_handle);
                event.gatt_event.char_read.char_handle = srv_handle + p_read_req->att_idx;
                event.gatt_event.char_read.offset = p_read_req->offset;

                p_read_info->conn_idx = p_cb_data->msg_data.gatts_op_info.conn_idx;
                p_read_info->char_handle = event.gatt_event.char_read.char_handle;
                p_read_info->token = p_read_req->token;
                p_read_info->max_len = p_read_req->max_len;
                p_read_info->offset = p_read_req->offset;
                INIT_DLIST_HEAD(&p_read_info->list);
                list_add_tail(&p_read_info->list, &adp_env.read_list);

                if (gatt_evt_cb) {
                    gatt_evt_cb(&event);
                }
            }

        } else if (p_cb_data->msg_data.gatts_op_info.gatts_op_sub_evt == BLE_SRV_EVT_WRITE_REQ) {
            ble_gatts_write_req_t *p_write_req = &(p_cb_data->msg_data.gatts_op_info.gatts_op_data.write_req);
            ble_gatts_get_start_hdl(p_write_req->svc_id, &srv_handle);
            event.conn_handle = p_dev->conn_handle;

            if (is_cccd(p_write_req->svc_id, srv_handle + p_write_req->att_idx)) {
                event.type = TKL_BLE_GATT_EVT_SUBSCRIBE;
                event.gatt_event.subscribe.char_handle = get_char_handle_by_cccd_handle(p_write_req->svc_id, srv_handle + p_write_req->att_idx);
                // FIX TODO we now not record cccd value
                event.gatt_event.subscribe.prev_notify = 0;
                event.gatt_event.subscribe.cur_notify = (*p_write_req->p_val) & 0x01;
                event.gatt_event.subscribe.prev_indicate = 0;
                event.gatt_event.subscribe.cur_indicate = ((*p_write_req->p_val) & 0x02) >> 1;
            }
            else {
                event.type = TKL_BLE_GATT_EVT_WRITE_REQ;

                event.gatt_event.write_report.char_handle = srv_handle + p_write_req->att_idx;
                event.gatt_event.write_report.report.length = p_write_req->val_len;
                event.gatt_event.write_report.report.p_data = p_write_req->p_val;
            }

            if (gatt_evt_cb) {
                gatt_evt_cb(&event);
            }

        } else if (p_cb_data->msg_data.gatts_op_info.gatts_op_sub_evt == BLE_SRV_EVT_NTF_IND_SEND_RSP) {
            ble_gatts_ntf_ind_send_rsp_t *p_ntf_ind = &(p_cb_data->msg_data.gatts_op_info.gatts_op_data.ntf_ind_send_rsp);

            event.type = TKL_BLE_GATT_EVT_NOTIFY_TX;
            event.conn_handle = p_dev->conn_handle;
            ble_gatts_get_start_hdl(p_ntf_ind->svc_id, &srv_handle);

            event.gatt_event.notify_result.char_handle = srv_handle + p_ntf_ind->att_idx;
            event.gatt_event.notify_result.result = p_ntf_ind->status;
            if (gatt_evt_cb) {
                gatt_evt_cb(&event);
            }
        }
    } else if (p_cb_data->srv_msg_type == BLE_SRV_EVT_CONN_STATE_CHANGE_IND) {
        if (p_cb_data->msg_data.conn_state_change_ind.conn_state == BLE_CONN_STATE_DISCONNECTD) {

