NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
        }
    }

    else if (p_cb_data->srv_msg_type == BLE_SRV_EVT_SVC_ADD_RSP) {
        if (p_cb_data->msg_data.svc_add_rsp.status != BLE_ERR_NO_ERROR) {
            dlist_t *pos, *n;
            ble_cccd_info_t *p_info = NULL;
            if (!list_empty(&adp_env.srv_cccd_list)) {
                list_for_each_safe(pos, n, &adp_env.srv_cccd_list) {
                    p_info = list_entry(pos, ble_cccd_info_t, list);
                    if (p_info->srv_id == p_cb_data->msg_data.svc_add_rsp.svc_id) {
                        list_del(&p_info->list);
                        sys_mfree(p_info);
                        break;
                    }
                }
            }
        }
    }

    return status;
}

static void handle_gatts_msg(uint8_t type, ble_gatts_info_t *p_gatts_info)
{
    tkl_conn_dev_node_t *p_dev = NULL;

    if (type != GATTS_SUBTYPE_ADD_SRVS) {
        p_dev = tkl_ble_find_dev_by_conn_handle(p_gatts_info->data.val_info.conn_handle);
        if (p_dev == NULL) {
            return;
        }
    }

    dbg_print(NOTICE, "handle_gatts_msg type %d \r\n", type);

    switch(type) {
    case GATTS_SUBTYPE_ADD_SRVS: {
        uint8_t srv_id;
        uint8_t info;

        if (p_gatts_info->data.add_srvs.uuid_len == BLE_GATT_UUID_16_LEN) {
            info = SVC_UUID(16);
        }
        else if (p_gatts_info->data.add_srvs.uuid_len == BLE_GATT_UUID_32_LEN) {
            info = SVC_UUID(32);
        }
        else {
            info = SVC_UUID(128);
        }

        if (ble_gatts_svc_add(&srv_id, p_gatts_info->data.add_srvs.uuid128, p_gatts_info->data.add_srvs.start_handle, info, p_gatts_info->data.add_srvs.p_srv_table,
                                p_gatts_info->data.add_srvs.total_handles, ble_tuya_rw_cb) == BLE_ERR_NO_ERROR) {

            uint16_t i;
            ble_cccd_info_t *p_info = sys_malloc(sizeof(ble_cccd_info_t) + p_gatts_info->data.add_srvs.cccd_num * sizeof(uint32_t));
            uint16_t char_handle = 0;

            if (p_info) {
                p_info->cccd_num = 0;
                p_info->srv_id = srv_id;
                p_info->svc_handle = p_gatts_info->data.add_srvs.start_handle;
                INIT_DLIST_HEAD(&p_info->list);

                for(i = 0; i < p_gatts_info->data.add_srvs.total_handles; i++) {
                    if (*((uint16_t *)(p_gatts_info->data.add_srvs.p_srv_table[i].uuid)) == BLE_GATT_DECL_CHARACTERISTIC) {
                        char_handle = p_info->svc_handle + i + 1;
                    }
                    else if (*((uint16_t *)(p_gatts_info->data.add_srvs.p_srv_table[i].uuid)) == BLE_GATT_DESC_CLIENT_CHAR_CFG) {
                        p_info->cccd_handle_tuple[p_info->cccd_num] = (p_info->svc_handle + i) | (char_handle << 16);
                        p_info->cccd_num++;
                    }
                }
                list_add_tail(&adp_env.srv_cccd_list, &p_info->list);
            }
            else {
                dbg_print(ERR, "alloc cccd array fail \r\n");
            }
        }

        sys_mfree(p_gatts_info->data.add_srvs.p_srv_table);
    } break;

    case GATTS_SUBTYPE_SET_VAL: {
        tkl_read_info_t* p_read_info;
        uint16_t len;

        p_read_info = pop_front_read_op(p_dev->conidx);

        if (p_read_info != NULL) {
            len = ble_min(p_read_info->max_len, p_gatts_info->data.val_info.length);
            if (ble_gatts_svc_attr_read_cfm(p_read_info->conn_idx, p_read_info->token,
                                            BLE_ERR_NO_ERROR, p_gatts_info->data.val_info.length + p_read_info->offset,
                                            len, p_gatts_info->data.val_info.p_data) != BLE_ERR_NO_ERROR) {
                dbg_print(ERR, "read confirm fail \r\n");
            }

            sys_mfree(p_read_info);
        }
        sys_mfree(p_gatts_info->data.val_info.p_data);
    } break;

    case GATTS_SUBTYPE_VAL_NOTIFY: {
        if (ble_gatts_ntf_ind_send_by_handle(p_dev->conidx, p_gatts_info->data.val_info.char_handle, p_gatts_info->data.val_info.p_data,
                                         p_gatts_info->data.val_info.length, BLE_GATT_NOTIFY) != BLE_ERR_NO_ERROR) {
            dbg_print(ERR, "notify fail \r\n");
        }

        sys_mfree(p_gatts_info->data.val_info.p_data);
    } break;

    case GATTS_SUBTYPE_VAL_IND: {
        ble_gatts_ntf_ind_send_by_handle(p_dev->conidx, p_gatts_info->data.val_info.char_handle, p_gatts_info->data.val_info.p_data,
                                         p_gatts_info->data.val_info.length, BLE_GATT_INDICATE);

        sys_mfree(p_gatts_info->data.val_info.p_data);
    } break;

    default:
      break;
    }
}

/*
 * Gattc Application
 ****************************************************************************************
 */
static ble_status_t tkl_ble_app_gattc_cb(ble_gattc_co_msg_info_t *p_msg_info)
{
    TKL_BLE_GATT_PARAMS_EVT_T event;
    tkl_conn_dev_node_t *p_dev = tkl_ble_find_dev_by_conidx(p_msg_info->conn_idx);

    if (p_dev == NULL) {
        dbg_print(ERR, "tkl_ble_app_gattc_cb can't find conn_idx 0x%0x device\r\n", p_msg_info->conn_idx);
        return BLE_ERR_NO_ERROR;
    }

    sys_memset(&event, 0, sizeof(TKL_BLE_GATT_PARAMS_EVT_T));

    switch (p_msg_info->cli_cb_msg_type) {
    case BLE_CLI_CO_EVT_DISC_SVC_INFO_IND:
        dbg_print(NOTICE, "BLE_CLI_CO_EVT_DISC_SVC_INFO_IND start_hdl = 0x%x, end_hdl = 0x%x\r\n", p_msg_info->msg_data.disc_svc_ind.start_hdl, p_msg_info->msg_data.disc_svc_ind.end_hdl);

        if (gatt_evt_cb) {
            event.type = TKL_BLE_GATT_EVT_PRIM_SEV_DISCOVERY;
            event.conn_handle = p_dev->conn_handle;
            event.result = p_msg_info->msg_data.disc_svc_ind.status;
            if (p_msg_info->msg_data.disc_svc_ind.status == BLE_ERR_NO_ERROR) {
                event.gatt_event.svc_disc.svc_num = 1;
                event.gatt_event.svc_disc.services[0].start_handle = p_msg_info->msg_data.disc_svc_ind.start_hdl;
                event.gatt_event.svc_disc.services[0].end_handle = p_msg_info->msg_data.disc_svc_ind.end_hdl;
                event.gatt_event.svc_disc.services[0].uuid.uuid_type = p_msg_info->msg_data.disc_svc_ind.ble_uuid.type;
                sys_memcpy(event.gatt_event.svc_disc.services[0].uuid.uuid.uuid128, p_msg_info->msg_data.disc_svc_ind.ble_uuid.data.uuid_128, 16);
            }

            gatt_evt_cb(&event);
        }

        break;

    case BLE_CLI_CO_EVT_DISC_SVC_DONE_IND:
        if (p_msg_info->msg_data.disc_svc_ind.status != BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "BLE_CLI_CO_EVT_DISC_SVC_DONE_IND fail status 0x%x\r\n", p_msg_info->msg_data.disc_svc_ind.status);
        }

        break;

