NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
    case BLE_CLI_CO_EVT_DISC_CHAR_INFO_IND:
        dbg_print(NOTICE, "BLE_CLI_CO_EVT_DISC_CHAR_INFO_IND char_hdl = 0x%x\r\n", p_msg_info->msg_data.disc_char_ind.char_hdl);
        if (gatt_evt_cb) {
            event.type = TKL_BLE_GATT_EVT_CHAR_DISCOVERY;
            event.conn_handle = p_dev->conn_handle;
            event.result = p_msg_info->msg_data.disc_char_ind.status;
            if (p_msg_info->msg_data.disc_char_ind.status == BLE_ERR_NO_ERROR) {
                event.gatt_event.char_disc.char_num = 1;
                event.gatt_event.char_disc.characteristics[0].handle = p_msg_info->msg_data.disc_char_ind.char_hdl;
                event.gatt_event.char_disc.characteristics[0].uuid.uuid_type = p_msg_info->msg_data.disc_char_ind.ble_uuid.type;
                sys_memcpy(event.gatt_event.char_disc.characteristics[0].uuid.uuid.uuid128, p_msg_info->msg_data.disc_char_ind.ble_uuid.data.uuid_128, 16);
            }
            gatt_evt_cb(&event);
        }
        break;

     case BLE_CLI_CO_EVT_DISC_CHAR_DONE_IND:
        if (p_msg_info->msg_data.disc_svc_ind.status != BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "BLE_CLI_CO_EVT_DISC_CHAR_DONE_IND fail status 0x%x\r\n", p_msg_info->msg_data.disc_char_ind.status);
        }
        break;

     case BLE_CLI_CO_EVT_DISC_DESC_INFO_IND:
        dbg_print(NOTICE, "BLE_CLI_CO_EVT_DISC_DESC_INFO_IND desc_hdl = 0x%x\r\n", p_msg_info->msg_data.disc_desc_ind.desc_hdl);

        if (p_msg_info->msg_data.disc_desc_ind.ble_uuid.data.uuid_16 == BLE_GATT_DESC_CLIENT_CHAR_CFG) {
            if (gatt_evt_cb) {
                event.type = TKL_BLE_GATT_EVT_CHAR_DESC_DISCOVERY;
                event.conn_handle = p_dev->conn_handle;
                event.result = p_msg_info->msg_data.disc_desc_ind.status;
                if (p_msg_info->msg_data.disc_desc_ind.status == BLE_ERR_NO_ERROR) {
                    event.gatt_event.desc_disc.cccd_handle = p_msg_info->msg_data.disc_desc_ind.desc_hdl;
                }

                gatt_evt_cb(&event);
            }
        }
        break;

     case BLE_CLI_CO_EVT_DISC_DESC_DONE_IND:
        if (p_msg_info->msg_data.disc_desc_ind.status != BLE_ERR_NO_ERROR) {
            dbg_print(NOTICE, "BLE_CLI_CO_EVT_DISC_DESC_DONE_IND fail status 0x%x\r\n", p_msg_info->msg_data.disc_desc_ind.status);
        }
        break;

     case BLE_CLI_CO_EVT_READ_RSP:
        if (gatt_evt_cb) {
            event.conn_handle = p_dev->conn_handle;
            event.type = TKL_BLE_GATT_EVT_READ_RX;
            event.result = p_msg_info->msg_data.read_rsp.status;
            if (p_msg_info->msg_data.read_rsp.status == BLE_ERR_NO_ERROR) {
                event.gatt_event.data_read.char_handle = p_msg_info->msg_data.read_rsp.handle;
                event.gatt_event.data_read.report.length = p_msg_info->msg_data.read_rsp.length;
                event.gatt_event.data_read.report.p_data = p_msg_info->msg_data.read_rsp.p_value;
            }

            gatt_evt_cb(&event);
        }
        break;

     case BLE_CLI_CO_EVT_NTF_IND:
        if (gatt_evt_cb) {
            event.conn_handle = p_dev->conn_handle;
            event.type = TKL_BLE_GATT_EVT_NOTIFY_INDICATE_RX;
            event.gatt_event.data_report.char_handle = p_msg_info->msg_data.ntf_ind.handle;
            event.gatt_event.data_report.report.length = p_msg_info->msg_data.ntf_ind.length;
            event.gatt_event.data_report.report.p_data = p_msg_info->msg_data.ntf_ind.p_value;

            gatt_evt_cb(&event);
        }
        break;

     default:
         break;
     }

    return BLE_ERR_NO_ERROR;
}

static void handle_gattc_msg(uint8_t type, ble_gattc_info_t *p_gattc_info)
{
    tkl_conn_dev_node_t *p_dev = tkl_ble_find_dev_by_conn_handle(p_gattc_info->conn_handle);

    if (p_dev == NULL) {
        dbg_print(ERR, "handle_gattc_msg can't find conn_handle 0x%04x device\r\n", p_gattc_info->conn_handle);
        return;
    }

    //TKL_BLE_GATT_PARAMS_EVT_T event;
    dbg_print(NOTICE, "handle_gattc_msg type %d\r\n", type);
    switch(type) {
    case GATTC_SUBTYPE_DISC_SRV: {
        if(ble_gattc_co_disc_svc(p_dev->conidx, p_gattc_info->data.disc_info.start_handle, p_gattc_info->data.disc_info.end_handle) != BLE_ERR_NO_ERROR) {
            dbg_print(ERR, "handle_gattc_msg discover service fail\r\n");
        }
    } break;

    case GATTC_SUBTYPE_DISC_CHAR: {
        if(ble_gattc_co_disc_char(p_dev->conidx, p_gattc_info->data.disc_info.start_handle, p_gattc_info->data.disc_info.end_handle) != BLE_ERR_NO_ERROR) {
            dbg_print(ERR, "handle_gattc_msg discover char fail\r\n");
        }
    } break;

    case GATTC_SUBTYPE_DISC_DESC: {
        if(ble_gattc_co_disc_desc(p_dev->conidx, p_gattc_info->data.disc_info.start_handle, p_gattc_info->data.disc_info.end_handle) != BLE_ERR_NO_ERROR) {
            dbg_print(ERR, "handle_gattc_msg discover desc fail\r\n");
        }
    } break;

    case GATTC_SUBTYPE_WRITE_CMD: {
        if(ble_gattc_co_write_cmd(p_dev->conidx, p_gattc_info->data.write_info.char_handle,
                               p_gattc_info->data.write_info.val_len, p_gattc_info->data.write_info.p_value) != BLE_ERR_NO_ERROR) {
            dbg_print(ERR, "handle_gattc_msg write cmd fail\r\n");
        }

    } break;

    case GATTC_SUBTYPE_WRITE_REQ: {
        if(ble_gattc_co_write_req(p_dev->conidx, p_gattc_info->data.write_info.char_handle,
                               p_gattc_info->data.write_info.val_len, p_gattc_info->data.write_info.p_value) != BLE_ERR_NO_ERROR) {
            dbg_print(ERR, "handle_gattc_msg write request fail\r\n");
        }

    } break;

    case GATTC_SUBTYPE_READ_REQ: {
        if(ble_gattc_co_read(p_dev->conidx, p_gattc_info->data.read_char_handle, 0, 0) != BLE_ERR_NO_ERROR) {
            dbg_print(ERR, "handle_gattc_msg read request fail\r\n");
        }

    } break;

    default:
      break;
    }
}


static bool tkl_ble_app_msg_hdl(void *p_buf)
{
    uint8_t subtype;
    tkl_app_msg_t *p_msg = (tkl_app_msg_t *)p_buf;
    subtype = TKL_BLE_EVT_ID_SUBTYPE_GET(p_msg->id);

