NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
    switch (TKL_BLE_EVT_ID_TYPE_GET(p_msg->id)) {
    case TKL_BLE_APP_SCAN: {
        handle_scan_msg(subtype, &p_msg->data.scan_info);
    } break;

    case TKL_BLE_APP_ADV: {
        handle_adv_msg(subtype,  &p_msg->data.adv_info);
    } break;

    case TKL_BLE_APP_CONN: {
        handle_conn_msg(subtype,  &p_msg->data.conn_info);
    } break;

    case TKL_BLE_APP_GATTS: {
        handle_gatts_msg(subtype,  &p_msg->data.gatts_info);
    } break;

    case TKL_BLE_APP_GATTC: {
        handle_gattc_msg(subtype,  &p_msg->data.gattc_info);
    } break;

    default:

      break;

    }

    return true;
}


/*
 * GLOBAL FUNCTION DEFINITIONS
 ****************************************************************************************
 */
OPERATE_RET tuya_hal_gap_callback_register(CONST TKL_BLE_GAP_EVT_FUNC_CB gap_evt)
{
    gap_evt_cb = gap_evt;
    return OPRT_OK;
}

OPERATE_RET tuya_hal_gatt_callback_register(CONST TKL_BLE_GATT_EVT_FUNC_CB gatt_evt)
{
    gatt_evt_cb = gatt_evt;
    return OPRT_OK;
}

OPERATE_RET tuya_hal_init(UCHAR_T role)
{
    sys_memset(&adp_env, 0, sizeof(struct tkl_adp_env_tag));

    ble_power_on();

    ble_stack_init();

    // ble task init
    ble_stack_task_init(TKL_BLE_STACK_TASK_STACK_SIZE, TKL_BLE_STACK_TASK_PRIORITY);

    ble_app_task_init(TKL_BLE_APP_TASK_STACK_SIZE, TKL_BLE_APP_TASK_PRIORITY);

    ble_app_msg_hdl_reg(tkl_ble_app_msg_hdl);

    // ble module init
    ble_storage_init();

    if (ble_adp_init() != BLE_ERR_NO_ERROR) {
        dbg_print(NOTICE, "adapter init fail! check and restart again or reload image if necessary\r\n");
        return OPRT_OS_ADAPTER_BLE_INIT_FAILED;
    }

    ble_sec_init();
    ble_l2cap_init();
    ble_conn_init();
    ble_conn_callback_register(tkl_ble_app_conn_evt_handler);
    ble_sec_callback_register(tkl_ble_app_sec_evt_handler);

    if (role & TKL_BLE_ROLE_SERVER) {
        ble_adv_init();
        ble_gatts_init();
    }

    if (role & TKL_BLE_ROLE_CLIENT) {
        ble_scan_init(BLE_GAP_LOCAL_ADDR_STATIC);
        ble_scan_callback_register(tkl_ble_app_scan_mgr_evt_handler);

        //ble_gattc_init();
        ble_gattc_co_init();
        ble_gattc_co_cb_reg(tkl_ble_app_gattc_cb);
    }

    adp_env.role = role;

    INIT_DLIST_HEAD(&adp_env.read_list);
    INIT_DLIST_HEAD(&adp_env.srv_cccd_list);
    INIT_DLIST_HEAD(&adp_env.conn_dev_list);

    adp_env.adv_info.idx = TKL_ADV_INVALID_IDX;
    adp_env.adv_info.type = TKL_BLE_ADV_TYPE_LEGACY;
    adp_env.adv_info.prop = 0x0000;
    adp_env.adv_info.pri_phy = BLE_GAP_PHY_1MBPS;
    adp_env.adv_info.sec_phy = BLE_GAP_PHY_1MBPS;
    adp_env.adv_info.wl_enable = false;
    adp_env.adv_info.own_addr_type = BLE_GAP_LOCAL_ADDR_STATIC;
    adp_env.srv_add_handle = 0x100;

    ble_adp_callback_register(tkl_ble_adp_evt_handler);
    tkl_app_adapter_cfg();

    return OPRT_OK;
}


OPERATE_RET tuya_hal_scan_start(TKL_BLE_GAP_SCAN_PARAMS_T CONST *p_scan_params)
{
    tkl_app_msg_t scan_msg;

    if (p_scan_params->extended == 0 || p_scan_params->scan_channel_map != 0x07) {
        return OPRT_INVALID_PARM;
    }

    scan_msg.id = TKL_BLE_EVT_ID_SCAN(SCAN_SUBTYPE_ENABLE);
    scan_msg.data.scan_info.params = *p_scan_params;

    if (!ble_local_app_msg_send(&scan_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_OS_ADAPTER_BLE_SCAN_START_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_scan_stop()
{
    tkl_app_msg_t scan_msg;

    scan_msg.id = TKL_BLE_EVT_ID_SCAN(SCAN_SUBTYPE_DISABLE);

    if (!ble_local_app_msg_send(&scan_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_OS_ADAPTER_BLE_SCAN_STAOP_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_adv_start(TKL_BLE_GAP_ADV_PARAMS_T CONST *p_adv_params)
{
    tkl_app_msg_t adv_msg;

    if (p_adv_params->adv_type == TKL_BLE_GAP_ADV_TYPE_EXTENDED_NONCONN_NONSCANNABLE_DIRECTED) {
        return OPRT_INVALID_PARM;
    }

    adv_msg.id = TKL_BLE_EVT_ID_ADV(ADV_SUBTYPE_START);
    adv_msg.data.adv_info.data.params = *p_adv_params;

    if (!ble_local_app_msg_send(&adv_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_OS_ADAPTER_BLE_ADV_START_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_adv_stop()
{
    tkl_app_msg_t adv_msg;

    adv_msg.id = TKL_BLE_EVT_ID_ADV(ADV_SUBTYPE_STOP);

    if (!ble_local_app_msg_send(&adv_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_OS_ADAPTER_BLE_ADV_STOP_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_adv_rsp_data_set(TKL_BLE_DATA_T CONST *p_adv, TKL_BLE_DATA_T CONST *p_scan_rsp)
{
    tkl_app_msg_t adv_msg;

    tkl_ble_adv_data_t * p_data;

    if (p_adv != NULL) {
        p_data = sys_malloc(sizeof(tkl_ble_adv_data_t) + p_adv->length);
        if (p_data == NULL) {
            return OPRT_MALLOC_FAILED;
        }

        adv_msg.data.adv_info.data.adv_data.p_adv_data = p_data;
        sys_memcpy(p_data->data, p_adv->p_data, p_adv->length);
        p_data->length = p_adv->length;
    }
    else {
        adv_msg.data.adv_info.data.adv_data.p_adv_data = NULL;
    }

    if (p_scan_rsp != NULL) {
        p_data = sys_malloc(sizeof(tkl_ble_adv_data_t) + p_scan_rsp->length);

        if (p_data == NULL) {
            sys_mfree(adv_msg.data.adv_info.data.adv_data.p_adv_data);
            return OPRT_MALLOC_FAILED;
        }

        adv_msg.data.adv_info.data.adv_data.p_rsp_data = p_data;
        sys_memcpy(p_data->data, p_scan_rsp->p_data, p_scan_rsp->length);
        p_data->length = p_scan_rsp->length;
    }
    else {
        adv_msg.data.adv_info.data.adv_data.p_rsp_data = NULL;
    }

    adv_msg.id = TKL_BLE_EVT_ID_ADV(ADV_SUBTYPE_DATA_SET);

    if (!ble_local_app_msg_send(&adv_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_RESOURCE_NOT_READY;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_adv_rsp_data_update(TKL_BLE_DATA_T CONST *p_adv, TKL_BLE_DATA_T CONST *p_scan_rsp)
{
    tkl_app_msg_t adv_msg;

    tkl_ble_adv_data_t * p_data;

    if (p_adv != NULL) {
        p_data = sys_malloc(sizeof(tkl_ble_adv_data_t) + p_adv->length);
        if (p_data == NULL) {
            return OPRT_MALLOC_FAILED;
        }

        adv_msg.data.adv_info.data.adv_data.p_adv_data = p_data;
        sys_memcpy(p_data->data, p_adv->p_data, p_adv->length);
        p_data->length = p_adv->length;
    }
    else {
        adv_msg.data.adv_info.data.adv_data.p_adv_data = NULL;
    }

    if (p_scan_rsp != NULL) {
        p_data = sys_malloc(sizeof(tkl_ble_adv_data_t) + p_scan_rsp->length);

        if (p_data == NULL) {
            sys_mfree(adv_msg.data.adv_info.data.adv_data.p_adv_data);
            return OPRT_MALLOC_FAILED;
        }

        adv_msg.data.adv_info.data.adv_data.p_rsp_data = p_data;
        sys_memcpy(p_data->data, p_scan_rsp->p_data, p_scan_rsp->length);
        p_data->length = p_scan_rsp->length;
    }
    else {
        adv_msg.data.adv_info.data.adv_data.p_rsp_data = NULL;
    }


    adv_msg.id = TKL_BLE_EVT_ID_ADV(ADV_SUBTYPE_DATA_UPD);

    if (!ble_local_app_msg_send(&adv_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_RESOURCE_NOT_READY;
    }

