NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
    return OPRT_OK;

}

OPERATE_RET tuya_hal_ble_connect(TKL_BLE_GAP_ADDR_T CONST *p_peer_addr, TKL_BLE_GAP_SCAN_PARAMS_T CONST *p_scan_params, TKL_BLE_GAP_CONN_PARAMS_T CONST *p_conn_params)
{
    tkl_app_msg_t conn_msg;

    conn_msg.data.conn_info.data.conn_params.peer_addr = *p_peer_addr;
    conn_msg.data.conn_info.data.conn_params.scan_params = *p_scan_params;
    conn_msg.data.conn_info.data.conn_params.conn_params = *p_conn_params;

    conn_msg.id = TKL_BLE_EVT_ID_CONN(CONN_SUBTYPE_CONN);

    if (!ble_local_app_msg_send(&conn_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_OS_ADAPTER_BLE_GATT_CONN_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_ble_disconnect(USHORT_T conn_handle, UCHAR_T hci_reason)
{
    tkl_app_msg_t disconn_msg;

    disconn_msg.data.conn_info.data.disconn_reason = hci_reason;
    disconn_msg.data.conn_info.conn_handle = conn_handle;

    disconn_msg.id = TKL_BLE_EVT_ID_CONN(CONN_SUBTYPE_DISCON);

    if (!ble_local_app_msg_send(&disconn_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_OS_ADAPTER_BLE_GATT_DISCONN_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_ble_conn_param_update(USHORT_T conn_handle, TKL_BLE_GAP_CONN_PARAMS_T CONST *p_conn_params)
{
    tkl_app_msg_t params_upd_msg;

    params_upd_msg.data.conn_info.data.conn_upd_params = *p_conn_params;
    params_upd_msg.data.conn_info.conn_handle = conn_handle;

    params_upd_msg.id = TKL_BLE_EVT_ID_CONN(CONN_SUBTYPE_CONN_PARAM_UPD);

    if (!ble_local_app_msg_send(&params_upd_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_RESOURCE_NOT_READY;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_ble_rssi_get(USHORT_T conn_handle)
{
    tkl_app_msg_t rssi_msg;

    rssi_msg.data.conn_info.conn_handle = conn_handle;

    rssi_msg.id = TKL_BLE_EVT_ID_CONN(CONN_SUBTYPE_CONN_RSSI_GET);

    if (!ble_local_app_msg_send(&rssi_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_RESOURCE_NOT_READY;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_ble_name_set(CHAR_T *p_name)
{
    tkl_app_msg_t name_msg;
    uint16_t len;

    if (p_name == NULL) {
        return OPRT_NOT_SUPPORTED;
    }

    len = strlen(p_name);

    if (len > 512) {
        return OPRT_NOT_SUPPORTED;
    }

    name_msg.data.conn_info.data.p_name = sys_malloc(len + 1);

    if (name_msg.data.conn_info.data.p_name == NULL) {
        return OPRT_MALLOC_FAILED;
    }

    name_msg.id = TKL_BLE_EVT_ID_CONN(CONN_SUBTYPE_NAME_SET);
    sys_memcpy(name_msg.data.conn_info.data.p_name, p_name, len + 1);

    if (!ble_local_app_msg_send(&name_msg, sizeof(tkl_app_msg_t))) {
        sys_mfree(name_msg.data.conn_info.data.p_name);
        return OPRT_RESOURCE_NOT_READY;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_gatts_service_add(TKL_BLE_GATTS_PARAMS_T *p_service)
{
    tkl_app_msg_t srv_msg;
    uint8_t i, j;
    TKL_BLE_SERVICE_PARAMS_T *p_cur_service;
    TKL_BLE_CHAR_PARAMS_T *p_cur_char;
    uint16_t total_handle = 0;
    ble_gatt_attr_desc_t *p_srv_table = NULL;

    for (i = 0; i < p_service->svc_num; i++) {
        p_cur_service = &(p_service->p_service[i]);
        total_handle = 1;

        total_handle += calc_char_handle_num(p_cur_service);
        p_srv_table = sys_malloc(sizeof(ble_gatt_attr_desc_t) * total_handle);

        if (p_srv_table == NULL) {
            // Just continue
            continue;
        }

        sys_memset(p_srv_table, 0, sizeof(ble_gatt_attr_desc_t) * total_handle);
        if (p_cur_service->svc_uuid.uuid_type == TKL_BLE_UUID_TYPE_32) {
            srv_msg.data.gatts_info.data.add_srvs.uuid_len = BLE_GATT_UUID_32_LEN;
        }
        else if (p_cur_service->svc_uuid.uuid_type == TKL_BLE_UUID_TYPE_128) {
            srv_msg.data.gatts_info.data.add_srvs.uuid_len = BLE_GATT_UUID_128_LEN;
        }
        else {
            srv_msg.data.gatts_info.data.add_srvs.uuid_len = BLE_GATT_UUID_16_LEN;
        }

        sys_memcpy(srv_msg.data.gatts_info.data.add_srvs.uuid128, p_cur_service->svc_uuid.uuid.uuid128, BLE_GATT_UUID_128_LEN);
        srv_msg.id = TKL_BLE_EVT_ID_GATTS(GATTS_SUBTYPE_ADD_SRVS);
        srv_msg.data.gatts_info.data.add_srvs.p_srv_table = p_srv_table;
        srv_msg.data.gatts_info.data.add_srvs.total_handles = total_handle;
        srv_msg.data.gatts_info.data.add_srvs.cccd_num = 0;
        srv_msg.data.gatts_info.data.add_srvs.start_handle = adp_env.srv_add_handle;
        p_cur_service->handle = adp_env.srv_add_handle;
        adp_env.srv_add_handle += total_handle;

        total_handle = 0;
        if (p_cur_service->type == TKL_BLE_UUID_SERVICE_PRIMARY) {
            *((uint16_t *)(p_srv_table[0].uuid)) = BLE_GATT_DECL_PRIMARY_SERVICE;
        }
        else if (p_cur_service->type == TKL_BLE_UUID_SERVICE_SECONDARY) {
            *((uint16_t *)(p_srv_table[0].uuid)) = BLE_GATT_DECL_SECONDARY_SERVICE;
        }
        else {
            sys_mfree(p_srv_table);
            dbg_print(ERR, "tuya_hal_gatts_service_add wrong service type\r\n");
            continue;
        }
        p_srv_table[total_handle].info = PROP(RD);
        p_srv_table[total_handle].ext_info = 0;
        total_handle++;

        for (j = 0; j < p_cur_service->char_num; j++) {
            p_cur_char = &(p_cur_service->p_char[j]);

            p_cur_char->handle = p_cur_service->handle + total_handle;
            // character decl
            *((uint16_t *)(p_srv_table[total_handle].uuid)) = BLE_GATT_DECL_CHARACTERISTIC;
            p_srv_table[total_handle].info = PROP(RD);
            p_srv_table[total_handle].ext_info = 0;
            total_handle++;

            // character value
            if (p_cur_char->char_uuid.uuid_type == TKL_BLE_UUID_TYPE_32) {
                p_srv_table[total_handle].info |= ATT_UUID(32);
            }
            else if (p_cur_char->char_uuid.uuid_type == TKL_BLE_UUID_TYPE_128) {
                p_srv_table[total_handle].info |= ATT_UUID(128);
            }


            sys_memcpy(p_srv_table[total_handle].uuid, p_cur_char->char_uuid.uuid.uuid128, BLE_GATT_UUID_128_LEN);
            p_srv_table[total_handle].ext_info = p_cur_char->value_len;

            if (p_cur_char->property & TKL_BLE_GATT_CHAR_PROP_BROADCAST) {
                p_srv_table[total_handle].info |= PROP(BC);
            }

            if (p_cur_char->property & TKL_BLE_GATT_CHAR_PROP_READ) {
                p_srv_table[total_handle].info |= PROP(RD);
            }

