NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
            if (p_cur_char->property & TKL_BLE_GATT_CHAR_PROP_WRITE_NO_RSP) {
                p_srv_table[total_handle].info |= PROP(WC);
            }

            if (p_cur_char->property & TKL_BLE_GATT_CHAR_PROP_WRITE) {
                p_srv_table[total_handle].info |= PROP(WR);
            }

            if (p_cur_char->property & TKL_BLE_GATT_CHAR_PROP_NOTIFY) {
                p_srv_table[total_handle].info |= PROP(NTF);
            }

            if (p_cur_char->property & TKL_BLE_GATT_CHAR_PROP_INDICATE) {
                p_srv_table[total_handle].info |= PROP(IND);
            }

            if (p_cur_char->property & TKL_BLE_GATT_CHAR_PROP_WRITE_AUTHEN_SIGNED) {
                p_srv_table[total_handle].info |= PROP(WS);
            }

            if (p_cur_char->permission & TKL_BLE_GATT_PERM_READ_AUTHEN) {
                p_srv_table[total_handle].info |= SEC_LVL(RP, AUTH);
            }
            else if (p_cur_char->permission & TKL_BLE_GATT_PERM_READ_ENCRYPT) {
                p_srv_table[total_handle].info |= SEC_LVL(RP, UNAUTH);
            }

            if (p_cur_char->permission & TKL_BLE_GATT_PERM_WRITE_AUTHEN) {
                p_srv_table[total_handle].info |= SEC_LVL(WP, AUTH);
            }
            else if (p_cur_char->permission & TKL_BLE_GATT_PERM_WRITE_ENCRYPT) {
                p_srv_table[total_handle].info |= SEC_LVL(WP, UNAUTH);
            }

            if ((p_cur_char->permission & TKL_BLE_GATT_PERM_PREPARE_WRITE) == 0) {
                p_srv_table[total_handle].ext_info |= OPT(NO_OFFSET);
            }

            total_handle++;

            // cccd
            if (p_cur_char->property & (TKL_BLE_GATT_CHAR_PROP_NOTIFY | TKL_BLE_GATT_CHAR_PROP_INDICATE)) {
                *((uint16_t *)(p_srv_table[total_handle].uuid)) = BLE_GATT_DESC_CLIENT_CHAR_CFG;
                p_srv_table[total_handle].info = PROP(RD) | PROP(WR);
                p_srv_table[total_handle].ext_info = OPT(NO_OFFSET);
                total_handle++;
                srv_msg.data.gatts_info.data.add_srvs.cccd_num++;
            }

            // extended character
            if (p_cur_char->property & TKL_BLE_GATT_CHAR_PROP_EXT_PROP) {
                *((uint16_t *)(p_srv_table[total_handle].uuid)) = BLE_GATT_DESC_CHAR_EXT_PROPERTIES;
                p_srv_table[total_handle].info = PROP(RD);
                p_srv_table[total_handle].ext_info = OPT(NO_OFFSET);

                if (p_cur_char->permission & TKL_BLE_GATT_PERM_PREPARE_WRITE){
                    p_srv_table[total_handle].ext_info |= 0x0001;
                }
                total_handle++;
            }

        }

        if (!ble_local_app_msg_send(&srv_msg, sizeof(tkl_app_msg_t))) {
            sys_mfree(srv_msg.data.gatts_info.data.add_srvs.p_srv_table);
            adp_env.srv_add_handle -= total_handle;
            p_cur_service->handle = 0xFFFF;
            continue;
        }

    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_gatts_value_set(USHORT_T conn_handle, USHORT_T char_handle, UCHAR_T *p_data, USHORT_T length)
{
    tkl_app_msg_t set_val_msg;

    set_val_msg.data.gatts_info.data.val_info.p_data = sys_malloc(length);

    if (set_val_msg.data.gatts_info.data.val_info.p_data == NULL) {
        return OPRT_MALLOC_FAILED;
    }

    sys_memcpy(set_val_msg.data.gatts_info.data.val_info.p_data, p_data, length);
    set_val_msg.data.gatts_info.data.val_info.length = length;
    set_val_msg.data.gatts_info.data.val_info.conn_handle = conn_handle;
    set_val_msg.data.gatts_info.data.val_info.char_handle = char_handle;
    set_val_msg.id = TKL_BLE_EVT_ID_GATTS(GATTS_SUBTYPE_SET_VAL);

    if (!ble_local_app_msg_send(&set_val_msg, sizeof(tkl_app_msg_t))) {
        sys_mfree(set_val_msg.data.gatts_info.data.val_info.p_data);
        return OPRT_RESOURCE_NOT_READY;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_gatts_value_notify(USHORT_T conn_handle, USHORT_T char_handle, UCHAR_T *p_data, USHORT_T length)
{
    tkl_app_msg_t notify_val_msg;
    notify_val_msg.data.gatts_info.data.val_info.p_data = sys_malloc(length);

    if (notify_val_msg.data.gatts_info.data.val_info.p_data == NULL) {
        return OPRT_MALLOC_FAILED;
    }

    sys_memcpy(notify_val_msg.data.gatts_info.data.val_info.p_data, p_data, length);
    notify_val_msg.data.gatts_info.data.val_info.length = length;
    notify_val_msg.data.gatts_info.data.val_info.conn_handle = conn_handle;
    notify_val_msg.data.gatts_info.data.val_info.char_handle = char_handle;
    notify_val_msg.id = TKL_BLE_EVT_ID_GATTS(GATTS_SUBTYPE_VAL_NOTIFY);

    if (!ble_local_app_msg_send(&notify_val_msg, sizeof(tkl_app_msg_t))) {
        sys_mfree(notify_val_msg.data.gatts_info.data.val_info.p_data);
        return OPRT_OS_ADAPTER_BLE_NOTIFY_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_gatts_value_indicate(USHORT_T conn_handle, USHORT_T char_handle, UCHAR_T *p_data, USHORT_T length)
{
    tkl_app_msg_t notify_val_msg;
    notify_val_msg.data.gatts_info.data.val_info.p_data = sys_malloc(length);

    if (notify_val_msg.data.gatts_info.data.val_info.p_data == NULL) {
        return OPRT_MALLOC_FAILED;
    }

    sys_memcpy(notify_val_msg.data.gatts_info.data.val_info.p_data, p_data, length);
    notify_val_msg.data.gatts_info.data.val_info.length = length;
    notify_val_msg.data.gatts_info.data.val_info.conn_handle = conn_handle;
    notify_val_msg.data.gatts_info.data.val_info.char_handle = char_handle;
    notify_val_msg.id = TKL_BLE_EVT_ID_GATTS(GATTS_SUBTYPE_VAL_IND);

    if (!ble_local_app_msg_send(&notify_val_msg, sizeof(tkl_app_msg_t))) {
        sys_mfree(notify_val_msg.data.gatts_info.data.val_info.p_data);
        return OPRT_OS_ADAPTER_BLE_INDICATE_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_gattc_all_service_discovery(USHORT_T conn_handle)
{
    tkl_app_msg_t disc_srv_msg;

    disc_srv_msg.id = TKL_BLE_EVT_ID_GATTC(GATTC_SUBTYPE_DISC_SRV);
    disc_srv_msg.data.gattc_info.conn_handle = conn_handle;
    disc_srv_msg.data.gattc_info.data.disc_info.start_handle = 0x0001;
    disc_srv_msg.data.gattc_info.data.disc_info.end_handle = 0xFFFF;

    if (!ble_local_app_msg_send(&disc_srv_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_OS_ADAPTER_BLE_SVC_DISC_FAILED;
    }

