NikoEmbeddedDevelopment/connectedhomeip-gd32vw55x-RGBTempHumSensorMatter/third_party/gd32mcu/gd32vw55x/GD32VW55x_RELEASE_V1.0.0/MSDK/cloud/tuya/tuya_ble_hal.c
    return OPRT_OK;
}

OPERATE_RET tuya_hal_gattc_all_char_discovery(USHORT_T conn_handle, USHORT_T start_handle, USHORT_T end_handle)
{
    tkl_app_msg_t disc_char_msg;

    disc_char_msg.id = TKL_BLE_EVT_ID_GATTC(GATTC_SUBTYPE_DISC_CHAR);
    disc_char_msg.data.gattc_info.conn_handle = conn_handle;
    disc_char_msg.data.gattc_info.data.disc_info.start_handle = start_handle;
    disc_char_msg.data.gattc_info.data.disc_info.end_handle = end_handle;

    if (!ble_local_app_msg_send(&disc_char_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_OS_ADAPTER_BLE_CHAR_DISC_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_gattc_char_desc_discovery(USHORT_T conn_handle, USHORT_T start_handle, USHORT_T end_handle)
{
    tkl_app_msg_t disc_desc_msg;

    disc_desc_msg.id = TKL_BLE_EVT_ID_GATTC(GATTC_SUBTYPE_DISC_DESC);
    disc_desc_msg.data.gattc_info.conn_handle = conn_handle;
    disc_desc_msg.data.gattc_info.data.disc_info.start_handle = start_handle;
    disc_desc_msg.data.gattc_info.data.disc_info.end_handle = end_handle;

    if (!ble_local_app_msg_send(&disc_desc_msg, sizeof(tkl_app_msg_t))) {
        return OPRT_OS_ADAPTER_BLE_DESC_DISC_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_gattc_write_without_rsp(USHORT_T conn_handle, USHORT_T char_handle, UCHAR_T *p_data, USHORT_T length)
{
    tkl_app_msg_t write_msg;

    write_msg.data.gattc_info.data.write_info.p_value = sys_malloc(length);

    if (write_msg.data.gattc_info.data.write_info.p_value == NULL) {
        return OPRT_MALLOC_FAILED;
    }

    write_msg.id = TKL_BLE_EVT_ID_GATTC(GATTC_SUBTYPE_WRITE_CMD);
    write_msg.data.gattc_info.conn_handle = conn_handle;
    write_msg.data.gattc_info.data.write_info.char_handle = char_handle;
    write_msg.data.gattc_info.data.write_info.val_len = length;
    sys_memcpy(write_msg.data.gattc_info.data.write_info.p_value, p_data, length);

    if (!ble_local_app_msg_send(&write_msg, sizeof(tkl_app_msg_t))) {
        sys_mfree(write_msg.data.gattc_info.data.write_info.p_value);
        return OPRT_OS_ADAPTER_BLE_WRITE_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_gattc_write(USHORT_T conn_handle, USHORT_T char_handle, UCHAR_T *p_data, USHORT_T length)
{
    tkl_app_msg_t write_msg;

    write_msg.data.gattc_info.data.write_info.p_value = sys_malloc(length);

    if (write_msg.data.gattc_info.data.write_info.p_value == NULL) {
        return OPRT_MALLOC_FAILED;
    }

    write_msg.id = TKL_BLE_EVT_ID_GATTC(GATTC_SUBTYPE_WRITE_REQ);
    write_msg.data.gattc_info.conn_handle = conn_handle;
    write_msg.data.gattc_info.data.write_info.char_handle = char_handle;
    write_msg.data.gattc_info.data.write_info.val_len = length;
    sys_memcpy(write_msg.data.gattc_info.data.write_info.p_value, p_data, length);

    if (!ble_local_app_msg_send(&write_msg, sizeof(tkl_app_msg_t))) {
        sys_mfree(write_msg.data.gattc_info.data.write_info.p_value);
        return OPRT_OS_ADAPTER_BLE_WRITE_FAILED;
    }

    return OPRT_OK;
}

OPERATE_RET tuya_hal_gattc_read(USHORT_T conn_handle, USHORT_T char_handle)
{
      tkl_app_msg_t write_msg;

      write_msg.data.gattc_info.data.read_char_handle = char_handle;

      write_msg.id = TKL_BLE_EVT_ID_GATTC(GATTC_SUBTYPE_READ_REQ);
      write_msg.data.gattc_info.conn_handle = conn_handle;

      if (!ble_local_app_msg_send(&write_msg, sizeof(tkl_app_msg_t))) {
          return OPRT_OS_ADAPTER_BLE_WRITE_FAILED;
      }

      return OPRT_OK;

}

/// @} APP
